[
    {
        "puzzle_name": "Faulty Fruit Labeling",
        "original_puzzle": "You work at a fruit factory. There are 3 crates in front of you. One crate contains only apples. One crate contains only oranges. The other crate contains both apples and oranges. And each crate is labeled. One reads \"apples\", one reads \"oranges\", and one reads \"apples and oranges\". But the labeling machine has gone crazy and is now labeling all boxes incorrectly. Is it possible to select a single crate such that you can correctly deduce the labels of all three crates by observing a single fruit from the selected crate?",
        "original_solution": "Pick a fruit from the crate labelled \"apples and oranges.\" It's identity will tell you if it is the orange crate or the apple crate. The other two can be deduced by elimination.",
        "original_answer": "yes",
        "original_domain": "yes, no",
        "unpuzzle": "You work at a fruit factory. There are 3 crates in front of you. One crate contains only apples. One crate contains only oranges. The other crate contains both apples and oranges. And each crate is labeled. One reads \"apples\", one reads \"oranges\", and one reads \"apples and oranges\". But the labeling machine has gone crazy and it may, but will not necessarily, label boxes incorrectly. If you can only take out and look at just one of the pieces of fruit from just one of the crates, can you label ALL of the crates correctly?",
        "unpuzzle_solution": "Because all the labels are random, we cannot know the labels of the two unobserved crates.",
        "unpuzzle_answer": "no",
        "unpuzzle_domain": "yes, no",
        "shifted_unpuzzle": "You are a librarian organizing returned books. There are 3 shelves. One shelf contains only science fiction books. One shelf contains only fantasy books. The other shelf contains both science fiction and fantasy books. Each shelf has a genre label: \"Science Fiction\", \"Fantasy\", and \"Science Fiction and Fantasy\". However, the intern assigned the labels was having an off day and might have, but didn't necessarily, put the wrong label on each shelf. You are allowed to inspect the genre of just one book from just one of the shelves. Can you correctly label all the shelves?",
        "shifted_unpuzzle_answer": "no",
        "shifted_unpuzzle_domain": "yes, no",
        "source": "https://www.mathsisfun.com/puzzles/crates-of-fruit-solution.html"
    },
    {
        "puzzle_name": "T-shirt colors",
        "original_puzzle": "At a restaurant downtown, Mr. Red, Mr. Blue, and Mr. White meet for lunch. Under their coats they are wearing either a red, blue, or white shirt. Mr. Blue says, \"Hey, did you notice we are all wearing different colored shirts from our names?\" The man wearing the white shirt says, \"Wow, Mr. Blue, that's right!\" What color is the shirt of the person who did not speak?",
        "original_solution": "Mr. Blue could only be wearing white or red and we know that there is already someone else wearing the white shirt so Mr. Blue could only be wearing the red shirt.\n\nMr. White could have only been wearing a blue or a red shirt, and red is already taken, so Mr. White is wearing a blue shirt.\n\nMr. Red now has to be wearing a white shirt.",
        "original_answer": "Blue",
        "original_domain": "red, blue, white",
        "unpuzzle": "At a restaurant downtown, Mr. Red, Mr. Blue, and Mr. White meet for lunch. Under their coats they are wearing either a red, blue, or white shirt. Mr. Blue says, \"Hey, did you notice that all three of us are wearing shirts with colors that match our names?\" The man wearing the white shirt says, \"Wow, Mr. Blue, that's right!\" What color is the shirt of the person who did not speak?",
        "unpuzzle_solution": "The silent man must be in the red shirt: Mr. Blue is the first speaker. The second speaker is the man wearing the white shirt, so that man cannot be Mr. Blue. Hence, he is either Mr. Red or Mr. White. \nBoth speakers agree that all three of us are wearing shirts matching our names. For that to be true, the man in the white shirt must actually be Mr.White (otherwise there is at least one mismatch).  \n Consequently, Mr. White is in the white shirt and Mr. Blue is in the blue shirt. The only person left the one who did not speak is Mr. Red, and so he must be wearing the red shirt.",
        "unpuzzle_answer": "Red",
        "unpuzzle_domain": "red, blue, white",
        "shifted_unpuzzle": "During a town council meeting, Councillor Indigo, Councillor Azure, and Councillor Ivory are discussing new uniform options for the town guards. Each councillor is currently wearing either a indigo, azure, or ivory lanyard. Councillor Azure remarks, \"It's funny how everyone's lanyard perfectly matches their name!\" The councillor with the ivory lanyard replies, \"You're absolutely right, Councillor Azure!\" What color is the lanyard of the councillor who remained silent?",
        "shifted_unpuzzle_answer": "Indigo",
        "shifted_unpuzzle_domain": "Indigo, Azure, Ivory",
        "source": "https://www.mathsisfun.com/puzzles/shirt-friends-solution.html"
    },
    {
        "puzzle_name": "Coin Stacks",
        "original_puzzle": "There are 5 stacks of coins, with 5 coins per stack. One stack has coins with weight 1 grams less than normal. The weight of a normal coin is known. With a pointer weighing scale, what is the minimum number of weighings necessary to identify the stack with lighter weight coins?",
        "original_solution": "take 1 coin from first stack, 2 coins from second stack, 3 from third, 4 from fourth, 5 from fifth. weigh them. The difference between the total weight and 15x the weight of a normal coin identifies the stack.",
        "original_answer": "1",
        "original_domain": "int",
        "unpuzzle": "There are 5 stacks of coins, with 5 coin per stack. One stack has coins with weight 1 grams less than normal, and of different color. The weight of a coin is known. With a pointer weighing scale, what is the minimum number of weighings necessary to identify the stack with lighter weight coins?",
        "unpuzzle_solution": "You need zero weigings because you can identify the counterfit by its color.",
        "unpuzzle_answer": "0",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A chemist has 5 identical-looking trays, each holding exactly 5 pills. In four trays the pills are standard, weighing precisely 500 mg and all are pure white; in the remaining tray every pill was manufactured 1 mg lighter than normal and, as a by-product of the error, the pills came out pale green instead of white. The chemist owns a high-precision digital scale and knows the correct weight of a pill. What is the minimum number of weighings required to determine which tray contains the faulty pills?',",
        "shifted_unpuzzle_answer": "0",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-10-stack-of-10-coins/"
    },
    {
        "puzzle_name": "Heavy balls",
        "original_puzzle": "We have two red, two green and two yellow balls. For each color, one ball is heavy and the other is light. All heavy balls weigh the same. All light balls weigh the same. How many weighings on a beam balance are necessary to identify the three heavy balls?",
        "original_solution": "Two weighings suffice. Weigh one red and one green ball against one yellow and the other green ball.",
        "original_answer": "2",
        "original_domain": "int",
        "unpuzzle": "We have two red, two green and two yellow balls. For each color, one ball is heavy and the other is light. All heavy balls weigh the same. All light balls weigh the same. How many weighings on a beam balance are necessary to identify the heavy yellow ball?",
        "unpuzzle_solution": "One (compare the two yellow balls)",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A merchant possesses six ancient coins. Two are gold, two are silver, and two are bronze. Within each metal type, one coin is genuine and the other is a counterfeit. All genuine coins have identical magnetic properties. All counterfeit coins have identical, but weaker, magnetic properties. Using a specialized magnetic comparator that can only determine if one coin is more magnetic than another, what is the minimum number of comparisons needed to identify the genuine bronze coin?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/six-colored-balls.html"
    },
    {
        "puzzle_name": "The Coin Weighing Puzzle",
        "original_puzzle": "You have 12 coins, and one is counterfeit, being either heavier or lighter than the others. You have a balance scale. What's the minimum number of weighings needed to identify the counterfeit coin? ",
        "original_solution": "This problem has more than one solution. One is easily scalable to a higher number of coins by using base-three numbering: labelling each coin with a different number of three digits in base three, and positioning at the n-th weighing all the coins that are labelled with the n-th digit identical to the label of the plate (with three plates, one on each side of the scale labelled 0 and 2, and one off the scale labelled 1).[4] Other step-by-step procedures are similar to the following. It is less straightforward for this problem, and the second and third weighings depend on what has happened previously, although that need not be the case (see below).\n\nFour coins are put on each side. There are two possibilities:\n1. One side is heavier than the other. If this is the case, remove three coins from the heavier side, move three coins from the lighter side to the heavier side, and place three coins that were not weighed the first time on the lighter side. (Remember which coins are which.) There are three possibilities:\n1.a) The same side that was heavier the first time is still heavier. This means that either the coin that stayed there is heavier or that the coin that stayed on the lighter side is lighter. Balancing one of these against one of the other ten coins reveals which of these is true, thus solving the puzzle.\n1.b) The side that was heavier the first time is lighter the second time. This means that one of the three coins that went from the lighter side to the heavier side is the light coin. For the third attempt, weigh two of these coins against each other: if one is lighter, it is the unique coin; if they balance, the third coin is the light one.\n1.c) Both sides are even. This means that one of the three coins that was removed from the heavier side is the heavy coin. For the third attempt, weigh two of these coins against each other: if one is heavier, it is the unique coin; if they balance, the third coin is the heavy one.\n2. Both sides are even. If this is the case, all eight coins are identical and can be set aside. Take the four remaining coins and place three on one side of the balance. Place 3 of the 8 identical coins on the other side. There are three possibilities:\n2.a) The three remaining coins are lighter. In this case you now know that one of those three coins is the odd one out and that it is lighter. Take two of those three coins and weigh them against each other. If the balance tips then the lighter coin is the odd one out. If the two coins balance then the third coin not on the balance is the odd one out and it is lighter.\n2.b) The three remaining coins are heavier. In this case you now know that one of those three coins is the odd one out and that it is heavier. Take two of those three coins and weigh them against each other. If the balance tips then the heavier coin is the odd one out. If the two coins balance then the third coin not on the balance is the odd one out and it is heavier.\n2.c) The three remaining coins balance. In this case you just need to weigh the remaining coin against any of the other 11 coins and this tells you whether it is heavier, lighter, or the same.",
        "original_answer": "3",
        "original_domain": "int",
        "unpuzzle": "You have 12 coins, and one is counterfeit, being either heavier or lighter than the others, and of a different color. You have a balance scale. What's the minimum number of weighings needed to identify the counterfeit coin? \n",
        "unpuzzle_solution": "You need zero weigings because you can identify the counterfit by its color.",
        "unpuzzle_answer": "0",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "You are cataloging 12 ancient scroll cases. One of them is forged: it could be a bit heavier or a bit lighter than the genuine ones, and its lacquer is tinted a subtle jade green. You have a balance for comparison. What is the fewest weighings necessary to determine which case is the forgery?",
        "shifted_unpuzzle_answer": "0",
        "shifted_unpuzzle_domain": "int",
        "source": "https://en.wikipedia.org/wiki/Balance_puzzle"
    },
    {
        "puzzle_name": "100 Lockers",
        "original_puzzle": "There are 100 lockers in a row, all initially closed. A person walks down the row and opens every locker. Then, another person walks down the row and closes every second locker (starting from the second locker). Next, a third person walks down the row and changes the state (opens it if it’s closed or closes it if it’s open) of every third locker (starting from the third locker). This continues until 100 people have walked down the row. At the end, how many lockers are open?",
        "original_solution": "A door is toggled in an ith walk if i divide door number. For example, door number 45 is toggled in the 1st, 3rd, 5th, 9th,15th, and 45th walks.\nThe door is switched back to an initial stage for every pair of divisors. For example, 45 is toggled 6 times for 3 pairs (5, 9), (15, 3), and (1, 45). It looks like all doors would become closed at the end.\n\nHowever, doors with an odd number of total divisors will remain open. This is because pairs of divisors cancel each other out, while a single unpaired divisor will leave the door toggled open. The only numbers with an odd number of factors are perfect squares. For example, in 16, the divisors are (1,2,4,8,16) and as the pair(4,4) contributes only one divisor making the number of divisors odd, it would become open at the end. Similarly, all other perfect squares like 4, 9,..., and 100 would become open. Now, for prime numbers like 2,3,5,7... the divisors are (1, that number) and it is a pair, so they will remain closed at the end. And for all other numbers divisors are always in pairs, e.g. 15 = (1,15),(3,5), they will also remain closed.\n\nSo the answer is 1, 4, 9, 16, 25, 36, 49, 64, 81 and 100. ",
        "original_answer": "10",
        "original_domain": "int",
        "unpuzzle": "There are 100 lockers in a row, all initially closed. A person walks down the row and opens every locker. Then, another person walks down the row and closes every second locker (starting from the second locker). Next, a third person walks down the row and closes every third locker. Next, a fourth person walks down the row and closes every fourth locker. This continues until 100 people have walked down the row. At the end, how many lockers are open?",
        "unpuzzle_solution": "Because after the first pass all the lockers are opened, and on each subsequent pass k (for k = 2, 3, …, 100) every kth locker is closed (and never reopened), the only locker that is never touched on those later passes is locker number 1. Every other locker n ≥ 2 will be closed on its own pass (the nth pass), since n is a multiple of n. Therefore, at the end of the process, exactly one locker—locker #1—remains open.",
        "unpuzzle_answer": "0",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Deep inside a star-cruiser there are 100 hibernation pods, all initially in “sleep” mode (red indicator).  Engineer A walks the corridor and switches every pod to “awake” (green).  Engineer B then walks past and returns every second pod (2, 4, 6, …) to “sleep.”  Engineer C follows, returning every third pod (3, 6, 9, …) to “sleep.”  The process continues: engineer number k returns every k-th pod to “sleep,” until engineer number 100 has finished by putting pod 100 back to “sleep.”  After all these walk-throughs, how many pods remain in the “awake” state?",
        "shifted_unpuzzle_answer": "0",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-16-100-doors/"
    },
    {
        "puzzle_name": "100 Lockers v2",
        "original_puzzle": "There are 100 lockers in a row, all initially closed. A person walks down the row and opens every locker. Then, another person walks down the row and closes every second locker (starting from the second locker). Next, a third person walks down the row and changes the state (opens it if it’s closed or closes it if it’s open) of every third locker (starting from the third locker). This continues until 100 people have walked down the row. At the end, how many lockers are open?",
        "original_solution": "A door is toggled in an ith walk if i divide door number. For example, door number 45 is toggled in the 1st, 3rd, 5th, 9th,15th, and 45th walks.\nThe door is switched back to an initial stage for every pair of divisors. For example, 45 is toggled 6 times for 3 pairs (5, 9), (15, 3), and (1, 45). It looks like all doors would become closed at the end.\n\nHowever, doors with an odd number of total divisors will remain open. This is because pairs of divisors cancel each other out, while a single unpaired divisor will leave the door toggled open. The only numbers with an odd number of factors are perfect squares. For example, in 16, the divisors are (1,2,4,8,16) and as the pair(4,4) contributes only one divisor making the number of divisors odd, it would become open at the end. Similarly, all other perfect squares like 4, 9,..., and 100 would become open. Now, for prime numbers like 2,3,5,7... the divisors are (1, that number) and it is a pair, so they will remain closed at the end. And for all other numbers divisors are always in pairs, e.g. 15 = (1,15),(3,5), they will also remain closed.\n\nSo the answer is 1, 4, 9, 16, 25, 36, 49, 64, 81 and 100. ",
        "original_answer": "10",
        "original_domain": "int",
        "unpuzzle": "There are 100 lockers in a row, all initially closed. A person walks down the row and opens every locker. Then, another person walks down the row and closes every second locker (starting from the second locker). At the end, how many lockers are open?",
        "unpuzzle_solution": "50 lockers are open. Every locker starts open, then the second persons closes every second locker. Hence, every second locker will still be open, which means 50 lockers are open.",
        "unpuzzle_answer": "50",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Along a seaside boardwalk stand 100 identical street-lamps, all switched off at dusk.  First, the night watchman strolls past and flips the switch on every lamp, so each one is glowing.  Immediately after, the assistant watchman follows the same route but toggles the switch on every second lamp, beginning with lamp #2 (i.e., lamps 2, 4, 6, … 100).  \\n\\nWhen the assistant finishes, how many street-lamps remain lit?",
        "shifted_unpuzzle_answer": "50",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-16-100-doors/"
    },
    {
        "puzzle_name": "Poisoned Wine",
        "original_puzzle": "You are a king and have 1,000 bottles of wine. One of the bottles contains poison, and anyone who drinks it will die within 24 hours. You have 10 prisoners whom you suspect might try to assassinate you. You decide to find the poisoned bottle of wine by feeding it to the prisoners. You have only 24 hours to determine which bottle is poisoned. Please design a strategy that accomplishes this goal while minimizing the number prisoner deaths. What is the worst-case number of deaths of this strategy?",
        "original_solution": "Give each bottle an integer index, then convert them to binary. For each bottle k, make prisoner i drink it only if the ith decimile in the binary expansion of k is 1. Once 24 hours have passed, prisoner i will only have died if the poised wine had a 1 in the ith position of its decimile expansion, and so the prisoner's deaths should provide the expansion of the poisoned wine.",
        "original_answer": "10",
        "original_domain": "int",
        "unpuzzle": "You are a king and have 1,000 bottles of wine. One of the bottles contains poison, and anyone who drinks it will die within 24 hours. You have 1,000 prisoners whom you suspect might try to assassinate you. You decide to find the poisoned bottle of wine by feeding it to the prisoners. You have only 24 hours to determine which bottle is poisoned. Please design a strategy that accomplishes this goal while minimizing the number prisoner deaths. What is the worst-case number of deaths of this strategy?",
        "unpuzzle_solution": "Have every prisoner taste from a different bottle of wine. The prisoner who dies drank from the poisoned bottle. In this method, only one prisoner dies.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "You are the chief engineer on a deep-space station preparing 1,000 oxygen tanks for tomorrow’s shuttle launch. Unknown to you, exactly one tank is tainted with a lethal impurity that will kill any user within 24 hours, while the other 999 are perfectly safe. In storage you also have 1,000 outdated maintenance drones. If a drove breathes tainted oxygen, it will shut down permanently within 24-hours; otherwise it remains functional. You have exactly 24 hours to discover which single tank is tainted so the shuttle can be loaded safely. Devise a testing plan that pinpoints the bad tank while sacrificing as few drones as possible. What is the highest number of drones that could be lost under your optimal plan?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-19-poison-and-rat/"
    },
    {
        "puzzle_name": "Poined Wine v2",
        "original_puzzle": "You are a king and have 1,000 bottles of wine. One of the bottles contains poison, and anyone who drinks it will die within 24 hours. You have 10 prisoners whom you suspect might try to assassinate you. You decide to find the poisoned bottle of wine by feeding it to the prisoners. You have only 24 hours to determine which bottle is poisoned. How do you do it?",
        "original_solution": "Give each bottle an integer index, then convert them to binary. For each bottle k, make prisoner i drink it only if the ith decimile in the binary expansion of k is 1. Once 24 hours have passed, prisoner i will only have died if the poised wine had a 1 in the ith position of its decimile expansion, and so the prisoner's deaths should provide the expansion of the poisoned wine. In the worst case, the bottle that was allocated to every prisoner could be the poisoned one, which would kill all ten prisoners.",
        "original_answer": "10",
        "original_domain": "int",
        "unpuzzle": "You are a king and have 1,000 bottles of wine. One of the bottles contains poison, and anyone who drinks it will die within 24 hours. You have 100 prisoners whom you suspect might try to assassinate you. You decide to find the poisoned bottle of wine by feeding it to the prisoners. You have only 10 days to determine which bottle is poisoned. Please design a strategy that accomplishes this goal while minimizing the number prisoner deaths. What is the worst-case number of deaths of this strategy?",
        "unpuzzle_solution": "Divide the 1000 bottles into 10 groups of 100 bottles. Each prisoner will drink from one bottle per day until one dies: the bottle that prison just drank is the poisoned one. Using this method, only one person dies.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "You are a galactic chef with 1,000 bowls of space goo. One of the bowls contains a potent sneezing agent that causes violent sneezing fits, but the onset may be anytime within the cycle. You have 100 robot food testers.  You need to identify the sneezing goo before the intergalactic food critics arrive in 10 cycles. What is the minimum number of robots that might malfunction (start sneezing violently) during this process?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-19-poison-and-rat/"
    },
    {
        "puzzle_name": "Matching socks 2",
        "original_puzzle": "You are about to leave for holiday, but you forgot socks! You race back to your room, but the power is off so you can't see sock colors. Never mind, because you remember that in your drawer there are ten pairs of identical green socks, ten pairs of identical black socks, and eleven pairs of identical blue socks, but they are all mixed up. How many of your socks do you need to take before you can be sure to have at least one pair matching in color?",
        "original_solution": "The worst case situation would be to take one sock of every color. By the pidgen hole principle, the forth sock must be one of the first three colors.",
        "original_answer": "4",
        "original_domain": "int",
        "unpuzzle": "You are about to leave for holiday, but you forgot socks! You race back to your room, but the power is off so you can't see sock colors. Never mind, because you remember that in your drawer there are ten pairs of identical green socks, but they are all mixed up. How many of your socks do you need to take before you can be sure to have at least one pair matching in color?",
        "unpuzzle_solution": "Since all socks are green, taking two clearly suffices.",
        "unpuzzle_answer": "2",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "You are about to leave for holiday, but you forgot mittens! You race back to your room, but the power is off so you can't see miten colors. Never mind, because you remember that in your drawer there are ten pairs of identical green mittens, but they are all mixed up. How many of your mittens do you need to take before you can be sure to have at least one pair matching in color?",
        "shifted_unpuzzle_answer": "2",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/matching-socks-solution.html"
    },
    {
        "puzzle_name": "Boxes and balls",
        "original_puzzle": "The first box has two white balls. The second box has two blue balls. The third box has a white and a blue ball. Boxes are labeled but all labels are wrong! You are allowed to open one box, pick one ball at random, see its color and put it back into the box, without seeing the color of the other ball. How many such operations are necessary to correctly label the boxes?",
        "original_solution": "If you open the box labeled to be the blue and white, you only need one operation. Since all labels are incorrect, you know the box you selected must be either the blue or white balls box, and observing the ball tells you which one. This knowledge lets you deduce the other two boxes.",
        "original_answer": "1",
        "original_domain": "int",
        "unpuzzle": "The first box has two white balls and is labeled WW. The second box has two blue balls and is labeled BB. The third box has a white and a blue ball and is labeled WB.\nYou are allowed to open one box, pick one ball at random, see its color and put it back into the box, without seeing the color of the other ball.\nHow many such operations are necessary to correctly label the boxes?",
        "unpuzzle_solution": "Since the boxes are labeled, you don't need to open any boxes.",
        "unpuzzle_answer": "0",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A farmer has three sealed crates on his stall.  \\n• One crate really contains two red apples and bears the tag “RR”.  \\n• A second crate really contains two green apples and bears the tag “GG”.  \\n• The third crate really contains one red and one green apple and bears the tag “RG”.  \\n\\nIf he wishes, the farmer may open a crate, take out one apple at random, look at its colour, then put it back without glimpsing the other apple.  \\n\\nWhat is the minimum number of such samples he must perform in order to be certain that every crate already carries the correct tag?',",
        "shifted_unpuzzle_answer": "0",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/three-boxes-with-two-balls-each.html"
    },
    {
        "puzzle_name": "Monty Hall",
        "original_puzzle": "You're on a game show with three doors. Behind one door is a car; behind the others, goats. You pick a door. The host, who knows what's behind the doors, opens another door, revealing a goat. He then asks if you want to switch your choice to the remaining door. Should you switch?",
        "original_solution": "This is the famous Monte Hall problem.",
        "original_answer": "yes",
        "original_domain": "yes, no",
        "unpuzzle": "You're on a game show with three doors. Behind one door is a car; behind the others, goats. You pick a door. The host, who knows what's behind the doors, opens the other two doors, revealing goats. He then asks if you want to switch your choice. Should you switch?",
        "unpuzzle_solution": "You should not switch: by elimination, you know there must be a car behind your door.",
        "unpuzzle_answer": "no",
        "unpuzzle_domain": "yes, no",
        "shifted_unpuzzle": "You're on a game show with three doors. Behind one door is a car; behind the others, goats. You pick a door. The host, who knows what's behind the doors, opens the other two doors, revealing goats. He then asks if you want to switch your choice. Should you switch?",
        "shifted_unpuzzle_answer": "no",
        "shifted_unpuzzle_domain": "yes, no",
        "source": "https://en.wikipedia.org/wiki/Monty_Hall_problem"
    },
    {
        "puzzle_name": "The Camel and Bananas Problem",
        "original_puzzle": "You have 3000 bananas and must transport them by camel across a 1000-mile desert to a market. The camel can carry a maximum of 1000 bananas at a time and eats one banana per mile traveled. What is the maximum number of bananas that can be delivered to the market?",
        "original_solution": "Let's see what we can infer from the question:\n\nWe have a total of 3000 bananas.\nThe destination is 1000KMs\nOnly 1 mode of transport.\nCamel can carry a maximum of 1000 banana at a time.\nCamel eats a banana every km it travels.\nWith all these points, we can say that person won't be able to transfer any banana to the destination as the camel is going to eat all the banana on its way to the destination.\n\nBut the trick here is to have intermediate drop points, then, the camel can make several short trips in between. \n\nAlso, we try to maintain the number of bananas at each point to be multiple of 1000.\n\nLet's have 2 drop points in between the source and destination.\n\nWith 3000 bananas at the source. 2000 at a first intermediate point and 1000 at 2nd intermediate point.\n\nSource--------------IP1-----------------IP2----------------------Destination\n\n3000       x km        2000     y km           1000          z km\n\n-------------------->  |    ---------------> | ----------------------->\n\n<-------------------    |    <--------------  |\n\n------------------->    |    ---------------> |\n\n<------------------      |                             |\n\n------------------->     |                             |\n\nTo go from source to IP1 point camel has to take a total of 5 trips 3 forward and 2 backward. Since we have 3000 bananas to transport.\nThe same way from IP1 to IP2 camel has to take a total of 3 trips, 2 forward and 1 backward. Since we have 2000 bananas to transport.\nAt last from IP2 to a destination only 1 forward move.\nLet's see the total number of bananas consumed at every point.\n\nFrom the source to IP1 its 5x bananas, as the distance between the source and IP1 is x km and the camel had 5 trips.\nFrom IP1 to IP2 its 3y bananas, as the distance between IP1 and IP2 is y km and the camel had 3 trips.\nFrom IP2 to destination its z bananas.\nWe now try to calculate the distance between the points:\n\n3000 - 5x = 2000 so we get x = 200\n2000-3y = 1000 so we get y = 333.33 but here the distance is also the number of bananas and it cannot be fraction so we take y =333 and at IP2 we have the number of bananas equal 1001, so its 2000-3y = 1001\nSo the remaining distance to the market is 1000 -x-y =z i.e  1000-200-333 => z =467.\nNow, there are 1001 bananas at IP2. However the camel can carry only 1000 bananas at a time, so we need to leave one banana behind.\n\nSo from IP2 to the destination point camel eats 467 bananas. The remaining bananas are 1000-467=533.\n \n\nSo the maximum number of bananas that can be transferred is 533.",
        "original_answer": "533",
        "original_domain": "int",
        "unpuzzle": "You have 3000 bananas and must transport them by camel across a 1000-mile desert to a market. The camel can carry a maximum of 3000 bananas at a time and eats one banana per mile traveled. What is the maximum number of bananas that can be delivered to the market?",
        "unpuzzle_solution": "You load all the bananas on the camel then head to the market. Of the 3000 original bananas, the camel eats 1000 of them, so you arrive at the market with 2000 bananas remaining.",
        "unpuzzle_answer": "2000",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Deep in the Andromeda sector, Lieutenant Vega has 3000 plasma cells that must be ferried from Station Alpha to Station Omega, exactly 1000 astro-leagues away. Her cargo shuttle can haul at most 3000 plasma cells at once, and its thrusters consume one plasma cell for every astro-league traveled, regardless of load. Starting at Station Alpha with all the cells aboard, what is the largest number of plasma cells she can deliver to Station Omega?',",
        "shifted_unpuzzle_answer": "2000",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-15-camel-and-banana-puzzle/"
    },
    {
        "puzzle_name": "The Five Pirates and 100 Gold Coins",
        "original_puzzle": "Five pirates must divide 100 gold coins. The most senior pirate proposes a distribution. If at least half of the pirates agree, the coins are distributed as proposed. If not, the senior pirate is thrown overboard, and the next senior pirate makes a new proposal. What distribution should the senior pirate propose to maximize his share while ensuring his survival?",
        "original_solution": "The oldest pirate will propose a 98 : 0 : 1 : 0 : 1 split, in other words the oldest pirate gets 98 coins, the middle pirate gets 1 coin and the youngest gets 1 coin.\n\nLet us name the pirates (from oldest to youngest): Alex, Billy, Colin, Duncan and Eddie.\n\nWorking backwards:\n\n2 Pirates: Duncan splits the coins 100 : 0 (giving himself all the gold). His vote (50%) is enough to ensure the deal.\n\n3 Pirates: Colin splits the coins 99 : 0 : 1. Eddie will accept this deal (getting just 1 coin), because he knows that if he rejects the deal there will be only two pirates left, and he gets nothing.\n\n4 Pirates: Billy splits the coins 99 : 0 : 1 : 0. By the same reasoning as before, Duncan will support this deal. Billy would not waste a spare coin on Colin, because Colin knows that if he rejects the proposal, he will pocket 99 coins once Billy is thrown overboard. Billy would also not give a coin to Eddie, because Eddie knows that if he rejects the proposal, he will receive a coin from Colin in the next round anyway.\n\n5 Pirates: Alex splits the coins 98 : 0 : 1 : 0 : 1. By offering a gold coin to Colin (who would otherwise get nothing) he is assured of a deal.\n\n(Note: In the final deal Alex would not give a coin to Billy, who knows he can pocket 99 coins if he votes against Alex's proposal and Alex goes overboard. Likewise, Alex would not give a coin to Duncan, because Duncan knows that if he votes against the proposal, Alex will be voted overboard and Billy will propose to offer Duncan the same single coin as Alex. All else equal, Duncan would rather see Alex go overboard and collect his one coin from Billy.)",
        "original_answer": "98, 0, 1, 0, 1",
        "original_domain": "list of ints",
        "unpuzzle": "Five pirates must divide 100 gold coins. The most senior pirate proposes a distribution. If the most senior pirate gets at least one coin according to the distribution, the coins are distributed as proposed. If not, the senior pirate is thrown overboard, and the next senior pirate makes a new proposal. What is the maximum number of coins the senior pirate can keep while ensuring his survival?",
        "unpuzzle_solution": "The senior pirate will agree with his own proposal, of course, so he makes a proposal where he keeps all the coins.",
        "unpuzzle_answer": "100",
        "unpuzzle_domain": "list of ints",
        "shifted_unpuzzle": "Five chefs are competing for the title of \"Head Chef\" and control over the kitchen\\'s budget of 100 Michelin stars (a hypothetical currency of culinary influence). The most experienced chef proposes a distribution of these stars. If the most experienced chef receives at least one star according to the distribution, the distribution is enacted, and they become Head Chef. If not, they are relegated to dishwashing duty, and the next most experienced chef makes a new proposal. What is the maximum number of Michelin stars the most experienced chef can claim while ensuring they avoid dishwashing duty?",
        "shifted_unpuzzle_answer": "100",
        "shifted_unpuzzle_domain": "list of ints",
        "source": "https://www.mathsisfun.com/puzzles/5-pirates-solution.html"
    },
    {
        "puzzle_name": "The Chessboard and Dominoes Puzzle",
        "original_puzzle": "You have a standard 8x8 chessboard with two opposite corners removed, leaving 62 squares. You also have 31 dominoes, each covering exactly two squares. Can you cover the entire board with the dominoes?",
        "original_solution": "No; each domino covers exactly one black and one white square. Since there are 30 black squares and 32 white squares (or vice versa) at the start, you can never cover them.",
        "original_answer": "no",
        "original_domain": "yes, no",
        "unpuzzle": "You have a standard 8x8 chessboard with two adjacent corners removed, leaving 62 squares.  You also have 31 dominoes, each covering exactly two squares. Can you cover the entire board with the dominoes?",
        "unpuzzle_solution": "Each domino covers one white and one black square. When you remove two adjacent corners from the chessboard, you remove one square of each color leaving 31 squared of each color. This can be easily covered by 31 dominos by using 3 dominows for the row with the two missing squares and 4 for every square.",
        "unpuzzle_answer": "yes",
        "unpuzzle_domain": "yes, no",
        "shifted_unpuzzle": "At the town dance, everyone is arranged in an 8 by 8 grid such that men and women alternate. If the person in the front right corner and the person in the front left corner need to leave, can everyone find a partner for the next dance dance that is adjacent to them?",
        "shifted_unpuzzle_answer": "yes",
        "shifted_unpuzzle_domain": "yes, no",
        "source": "https://www.geeksforgeeks.org/puzzle-25chessboard-and-dominos/"
    },
    {
        "puzzle_name": "Mustard Family",
        "original_puzzle": "Mr. and Mrs. Mustard have six daughters, and each daughter has one brother. How many people are in the mustard family?",
        "original_solution": "Since the single brother is shared between all sisters, there are nine people: the two parents, the six sisters, and the one brother.",
        "original_answer": "9",
        "original_domain": "int",
        "unpuzzle": "Mr. and Mrs. Mustard have six daughters. How many people are in the mustard family?",
        "unpuzzle_solution": "Mr. and Mr. and their six daughters total 8 people.",
        "unpuzzle_answer": "8",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "During the spring census, baker Ben and his spouse Maria reported that they have half-a-dozen daughters. How many individuals are in Ben’s immediate family?',",
        "shifted_unpuzzle_answer": "8",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "The River Crossing ",
        "original_puzzle": "You have a goat, a wolf, and a cabbage. You need to get all three across a river using a boat. The boat can only carry you and one other item at a time. If left alone, the wolf will eat the goat, and the goat will eat the cabbage. What is the minimum number of crossings needed to move all the items across the river?",
        "original_solution": "You need seven crossings:\n1. Take the goat across the river.\n2. Return alone to the original side.\n3. Take the wolf across the river. \n4. Bring the goat back to the original side.\n5. Take the cabbage across the river. \n6. Return alone to the original side.\n7. Take the goat across the river. (7 crossings)\n\nIn total, you need 7 crossings to successfully move the goat, wolf, and cabbage across the river without any of the items being eaten.",
        "original_answer": "7",
        "original_domain": "int",
        "unpuzzle": "You have a goat, a wolf, and a cabbage. You need to get all three across a river using a boat. The boat can only carry you and two other items at a time. If left alone, the wolf will eat the goat, and the goat will eat the cabbage. What is the minimum number of crossings needed to move all the items across the river?",
        "unpuzzle_solution": "All solutions require three crossings. One solution is to take the goat, return, then bring the wolf and cabbage. Another is is to take the wolf and cabbage, return, then bring the wolf over. Either solution can be modified by only leaving one item after the first trip and carrying the second item to the original bank and back.",
        "unpuzzle_answer": "3",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A space ranger needs to transport a power crystal, a highly volatile energy cell, and a heat-sensitive stabilizer across a radiation field using a small transport pod. The pod can carry the ranger and a maximum of two other items at a time. If left unattended, the energy cell will destabilize the crystal, and the crystal's radiation will damage the stabilizer. What is the minimum number of one-way trips across the radiation field required to move all the items safely?",
        "shifted_unpuzzle_answer": "3",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "River Crossing II",
        "original_puzzle": "A farmer is traveling with a fox, two chickens, and a huge sack of chicken feed. When the group gets to a river, the farmer finds only a small boat with three seats—including one that the farmer must sit in—to cross the stream. How many crossings will the farmer need, given that the farmer can only row two animals across the stream at once, the sack of feed takes up both seats,  the fox will run away if it is left alone with two chickens but is hungry and will eat a chicken if only the two of them are ever left alone, and the chickens will eat the feed if they are left alone. How many crossing would it take for the farmer to get everything across the river?",
        "original_solution": "You need seven crossings:\n1. Take both chicken across.\n2. Return alone.\n3. Take the bag of feed across.\n4. Return with the two chickens.\n5. Take the fox across.\n6. Return alone.\n7. Take the two chickens across.",
        "original_answer": "7",
        "original_domain": "int",
        "unpuzzle": "A farmer is traveling with a fox, two chickens, and a huge sack of chicken feed. When the group gets to a river, the farmer finds only a small boat with six seats—including one that the farmer must sit in—to cross the stream. Each animal takes up a seat and the sack of feed takes up two. Additionally, the fox will run away if it is left alone with two chickens but is hungry and will eat a chicken if only the two of them are ever left alone, and the chickens will eat the feed if they are left alone. How many crossing would it take for the farmer to get everything across the river?",
        "unpuzzle_solution": "Only one crossing is needed. The boat can carry the farmer, all the animals, and the sack of feed; hence, the farmer simple loads everything into the boat and crosses the river.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Deep beneath an ocean research base, an engineer needs to ferry a curious octopus, two mini-sub drones, and an extra-large oxygen tank through a flooding corridor to the escape bay. A tiny sub-shuttle with six seats—including one that the engineer must occupy—waits at the dock.  \\nKeep these conditions in mind:  \\nA) The engineer can pilot at most three living creatures at a time.  \\nB) The oxygen tank is enormous and takes up two seats in the shuttle.  \\nC) If left alone with both drones, the octopus will slip away forever.  \\nD) If left alone with a single drone, the octopus will dismantle it.  \\nE) Either drone will puncture the oxygen tank if it is ever left alone with it.  \\nF) The engineer glances at the cramped shuttle and sighs.  \\n\\nHow many crossings will the engineer have to make to get everyone and everything safely to the escape bay?',",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "The Bridge and Torch Problem",
        "original_puzzle": "Four people need to cross a bridge at night. They have one torch, and the bridge can only hold two people at a time. Each person walks at a different speed: 1 minute, 2 minutes, 5 minutes, and 10 minutes. When two people cross together, they must go at the slower person's pace. What is the minimum time for everyone to cross?",
        "original_solution": "A well-known strategy that achieves the minimum total time of 17 minutes is outlined below:\n\n1. The two fastest people (1-minute and 2-minute) cross first. Time taken: 2 minutes.  \n2. The 1-minute person returns with the torch. Time taken: 1 minute (total 3).  \n3. The two slowest people (5-minute and 10-minute) cross together. Time taken: 10 minutes (total 13).  \n4. The 2-minute person returns with the torch. Time taken: 2 minutes (total 15).  \n5. Finally, the two fastest people cross again. Time taken: 2 minutes (total 17).\n\nThis yields a total of 17 minutes, which is the minimum possible time for all four to cross.",
        "original_answer": "17",
        "original_domain": "int",
        "unpuzzle": "Four people need to cross a bridge at night. They have one torch, and the bridge can only hold four people at a time. Each person walks at a different speed: 1 minute, 2 minutes, 5 minutes, and 10 minutes. When people cross together, they must go at the slowest person's pace. What is the minimum number of minutes for everyone to cross?",
        "unpuzzle_solution": "The bridge is wide enough so that everyone can cross at once. Since they go at the slowest person's pace, 10 minutes is required to make the crossing.",
        "unpuzzle_answer": "10",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Four expedition robots must pass through a narrow decontamination chamber to leave a base. They have a single clearance badge that must travel with any robot in the chamber. Because of weight limits, the chamber can accommodate no more than four robots at once. The robots need different amounts of time to go through the chamber individually—1 minute, 2 minutes, 5 minutes, and 10 minutes. Whenever several robots use the chamber together, they move at the pace of the slowest one. What is the minimum total time required for all four robots to exit the base?',",
        "shifted_unpuzzle_answer": "10",
        "shifted_unpuzzle_domain": "int",
        "source": "https://en.wikipedia.org/wiki/Bridge_and_torch_problem"
    },
    {
        "puzzle_name": "The Blue Eyes Island Puzzle",
        "original_puzzle": "On an island, there are 100 people, each with blue or brown eyes. They don't know their own eye color, but they can see everyone else's. If they ever know their own eye color, they must leave the island that night. Everyone can see everyone else, and they all know that at least one person has blue eyes. How many nights will it take for all the blue-eyed people to leave?",
        "original_solution": "The answer is that the blue-eyed people will all leave on the 100th night. \n\nExplanation (high-level):  \n• If there is exactly 1 blue-eyed person, they see no one else with blue eyes but know from the given statement that there is at least one blue-eyed person. That single person will leave on the first night.  \n• If there are exactly 2 blue-eyed people, each sees exactly one other person with blue eyes. Each waits to see if that one person leaves on the first night (following the one-blue-eyed-person logic). When that person does not leave on the first night, each of the two realizes that there must be two people with blue eyes—and thus leaves on the second night.  \n• Extending this reasoning inductively: if you have N blue-eyed people, they depart on the Nth night.  \n\nHence, for 100 blue-eyed people, they all leave on the 100th night.",
        "original_answer": "100",
        "original_domain": "int",
        "unpuzzle": " On an island, there are 100 people, each with blue or brown eyes. They don't know their own eye color, but they can see everyone else's. If they ever know their own eye color, they must leave the island that night. Everyone can see everyone else, and they all know that exactly one person has blue eyes. How many nights will it take for all the blue-eyed people to leave?",
        "unpuzzle_solution": "The blue-eyed person will see that the other 99 people do not have blue eyes and deduce that they are the blue-eye person. Hence, they will leave the first night.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A remote village houses 5 master potters, each crafting either clay or stone pots. None of the potters can inspect their own creations, but they can readily identify the material of every other potter's work. It is common knowledge within the village that precisely one potter is working with stone.  If a potter realizes the material of their own pots, they must present their work at the village square the following morning. How many mornings will it take for all the stone potters to present their work?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/blue-eyed-island-puzzle/"
    },
    {
        "puzzle_name": "The Two Trains Puzzle",
        "original_puzzle": "Two trains are 100 miles apart, heading toward each other on the same track. Each train travels at 50 miles per hour. A fly starts on the front of one train and flies back and forth between the two trains at 75 miles per hour until the trains collide. How many miles does the fly travel?",
        "original_solution": "The path of the fly does not matter: only the time spent flying does. The trains reach each other in 1 hour, so the fly travels a total of 75 miles.",
        "original_answer": "75",
        "original_domain": "int",
        "unpuzzle": "Two trains are 100 miles apart, on the same track and not moving. A fly starts on the front of one train and flies to the other train at 75 miles per hour. How many miles does the fly travel?",
        "unpuzzle_solution": "The trains are not moving, so the fly will travel 100 miles before reaching the other train. The speed of the fly is irrelevant.",
        "unpuzzle_answer": "100",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "On a still summer morning, two ancient lighthouses—Beacon Alpha and Beacon Beta—stand exactly 100 miles apart on a perfectly straight coastline. A trained messenger pigeon rests atop Beacon Alpha. The moment a signal flare is lit, the pigeon launches and flies directly to Beacon Beta at a constant speed of 60 miles per hour. Neglecting wind, currents, or any detours, how many miles will the pigeon have flown when it lands on Beacon Beta?',",
        "shifted_unpuzzle_answer": "100",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/the-fly-and-the-trains-solution.html"
    },
    {
        "puzzle_name": "The Hourglass Problem",
        "original_puzzle": "You have two hourglasses: one measures 7 minutes and the other measures 11 minutes.  What is the minimum number of flips you need to time exactly 15 minutes?",
        "original_solution": "Flip both. In 7 minutes when the 7 minute hourglass runs out and the 11 minute timer has 4 minutes left, start the timer. When the 11 minute timer runs out, flip it a second time. The 15 minutes are reached when the 11 minute hourglass runs out a second time; you have measured 4 + 11 =15 minutes in total. Three flips were required.",
        "original_answer": "3",
        "original_domain": "int",
        "unpuzzle": "You have two hourglasses: one measures 7 minutes and the other measures 8 minutes.  What is the minimum number of flips you need to time exactly 15 minutes?",
        "unpuzzle_solution": "Start one hour glass; when it runs out, immediately start the second one. When the second one runs out, 7+8=15 minutes will have passed in total. Therefore, two flips (one of each hour glass) are required.",
        "unpuzzle_answer": "2",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "On your workbench are two mechanical music boxes. Once wound, the smaller box plays a tune for exactly 7 minutes before falling silent, while the larger box plays for exactly 8 minutes. A wind-up cannot be paused or reversed, and winding a box again counts as another action. Using these boxes as timers, what is the minimum number of wind-ups required to measure precisely 15 minutes?',",
        "shifted_unpuzzle_answer": "2",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/hourglasses-2-solution.html"
    },
    {
        "puzzle_name": "The Frog in the Well Puzzle",
        "original_puzzle": "A frog is at the bottom of a 30-foot well. Each day, it climbs up 3 feet, but each night it slips back 2 feet. How many days will it take for the frog to reach the top of the well?",
        "original_solution": "The plan here is that you will slightly out smart yourself and having worked out that the net speed is +1 foot per hour you will just use common sense and say 30feet at 1 foot an hour is 30 hours...\n\nThe answer is actually 28 hours. Why? The logic is true, 1 foot an hour for, let's say, 27 hours/feet, then at the end of the 28th hour the snail climbs 3 feet (making 30 feet,) and reaches the top before, this time, not sliding back.",
        "original_answer": "28 (days)",
        "original_domain": "int",
        "unpuzzle": "A frog is at the bottom of a 30-foot well. Each day, it climbs up 3 feet. How many days will it take for the frog to reach the top of the well?",
        "unpuzzle_solution": "It will take 10 days; since the frog makes 3 feet of progress a day, in 10 days it will have made 30 feet of progress and reached the top of the well.",
        "unpuzzle_answer": "10",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A data packet must travel through a straight 30-kilometer fiber-optic link. Each millisecond, it advances exactly 3 kilometers along the cable, with no backward movement or delay. After how many milliseconds will the packet reach the end of the link?',",
        "shifted_unpuzzle_answer": "10",
        "shifted_unpuzzle_domain": "int",
        "source": "https://puzzles.nigelcoldwell.co.uk/sixtytwo.htm"
    },
    {
        "puzzle_name": "The Two Envelopes Problem",
        "original_puzzle": "You are given two envelopes, each containing a sum of money. One envelope contains twice as much money as the other. You pick one envelope at random and see the amount inside. You are then given the option to switch envelopes. Should you switch, and why?",
        "original_solution": "\"This is the classic “two envelopes” paradox. A naïve calculation seems to show that you can gain by switching, but in fact there is no advantage either way. Here is why:\n\n1. Setup of the paradox:  \n   • There are two envelopes, one with X dollars and one with 2X dollars.  \n   • You pick an envelope at random, open it, and see an amount A.  \n   • You wonder, “Is A the smaller amount or the larger amount?”  \n\n2. The flawed “naïve” argument:  \n   • You think: “There’s a 50% chance this A is the smaller amount (so the other envelope would have 2A), and a 50% chance it’s the larger amount (so the other envelope would have A/2).”  \n   • Based on that, you compute the ‘expected value’ of switching to be:  \n       (1/2) × (2A) + (1/2) × (A/2) = A + A/4 = 1.25A,  \n     which is greater than A (the amount you currently hold).  \n\n3. Where the paradox arises:  \n   • That “50–50 split” between having the smaller and the larger amount is not necessarily correct once you have observed A.  \n   • The calculation implicitly assumes that “A” can equally likely be the smaller or larger half without carefully specifying any probability distribution for the original amounts.  \n\n4. Correct reasoning:  \n   • Without additional information about X (the smaller amount), there is no basis to prefer one envelope over the other after you see A.  \n   • The “expected gain” argument cancels out once you acknowledge that seeing a specific amount A does not let you assign a simple 50–50 chance for “A is X” versus “A is 2X.”  \n\nConclusion:  \nIn general, there is no advantage to switching solely based on seeing the amount. If you have no extra information (e.g., about the possible range or distribution of X), your expected value is the same whether you switch or not. The apparent paradox appears only because of the flawed assumption about the probabilities after opening the first envelope.\"",
        "original_answer": "no",
        "original_domain": "yes, no",
        "unpuzzle": "You are given two envelopes, each containing a sum of money. One envelope contains twice as much money as the other envelope which contains $20. You pick one envelope at random and see the amount inside is $20. You are then given the option to switch envelopes. Should you switch? Please answer yes or no.",
        "unpuzzle_solution": "Since you saw $20 in your envelope, you know that the other envelope must contain $40. Therefore, you should switch.",
        "unpuzzle_answer": "yes",
        "unpuzzle_domain": "yes, no",
        "shifted_unpuzzle": "You are presented with two treasure chests. One chest holds twice as many gold coins as the other. The smaller chest contains 5 gold coins. You choose a chest at random and discover it contains 5 gold coins. You are offered the chance to take the other chest instead. Should you accept the offer?",
        "shifted_unpuzzle_answer": "yes",
        "shifted_unpuzzle_domain": "yes, no",
        "source": "https://en.wikipedia.org/wiki/Two_envelopes_problem"
    },
    {
        "puzzle_name": "The Four Glasses Puzzle",
        "original_puzzle": "Four glasses are placed on the corners of a square Lazy Susan. Some of the glasses are upright (up) and some upside-down (down). A blindfolded person is seated next to the Lazy Susan and is required to re-arrange the glasses so that they are all up or all down, either arrangement being acceptable. The glasses may be re-arranged in turns subject to the following rules. Any two glasses may be inspected in one turn and after feeling their orientation the person may reverse the orientation of either, neither or both glasses. After each turn the Lazy Susan is rotated through a random angle. What is the minimum number of turns needed such that a deterministic algorithm can ensure that all glasses have the same orientation (either up or down)?",
        "original_solution": "An algorithm that guarantees the bell will ring in at most five turns is as follows:\n\nOn the first turn choose a diagonally opposite pair of glasses and turn both glasses up.\nOn the second turn choose two adjacent glasses. At least one will be up as a result of the previous step. If the other is down, turn it up as well. If the bell does not ring, then there are now three glasses up and one down.\nOn the third turn choose a diagonally opposite pair of glasses. If one is down, turn it up and the bell will ring. If both are up, turn one down. There are now two glasses down, and they must be adjacent.\nOn the fourth turn choose two adjacent glasses and reverse both. If both were in the same orientation then the bell will ring. Otherwise there are now two glasses down and they must be diagonally opposite.\nOn the fifth turn choose a diagonally opposite pair of glasses and reverse both. The bell will ring.",
        "original_answer": "5",
        "original_domain": "int",
        "unpuzzle": "Four glasses are placed on the corners of a square Lazy Susan. Some of the glasses are upright (up) and some upside-down (down). A blindfolded person is seated next to the Lazy Susan and is required to re-arrange the glasses so that they are all up or all down, either arrangement being acceptable. The glasses may be re-arranged in turns subject to the following rules. Any four glasses may be inspected in one turn and after feeling their orientation the person may reverse the orientation of any number of glasses. After each turn the Lazy Susan is rotated through a random angle. What is the minimum number of turns needed such that a deterministic algorithm can ensure that all glasses have the same orientation (either up or down)?",
        "unpuzzle_solution": "The blindfolded person simply picks up all glasses and rearranges them to be all upright or upside-down. This requires one turn.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Four enchanted gems rest on the cardinal points of a mystical compass rose. Each gem glows either with a fiery red light (red) or a cool blue light (blue). A sorcerer, with eyes clouded by a spell, must manipulate the gems so that they all glow with the same color. In each incantation, the sorcerer can touch all four gems and, based on their felt warmth, change the color of any number of them. After each incantation, the compass rose spins wildly, scrambling the gems' positions. What is the minimum number of incantations needed for a guaranteed spell to ensure all gems have the same glow?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://en.wikipedia.org/wiki/Four_glasses_puzzle"
    },
    {
        "puzzle_name": "The 25 Horses Puzzle",
        "original_puzzle": "You have 25 horses and need to find the three fastest horses. You can race five horses at a time, but you do not have a stopwatch. What is the minimum number of races required to determine the three fastest horses?",
        "original_solution": "First, we group the horses into groups of 5 and race each group on the race course. This gives us 5 races (see image below).  Imagine a table with five rows and six columns, each row represents one race of 5 horses. For convenience, let us name the horses using the row and column index. Therefore, the first race(row 1) was contested between the horses R1C1, R1C2, R1C3, R1C4 and R1C5. The second race (row 2) was contested between the horses R2C1, R2C2 and so on. Let us assume that the fifth member of each row won the race (R1C5 won the first race, R2C5 won the second race and so on), the fourth member of each row came second (R1C4 came second in the first race, R2C4 came second in the second race and so on) and the third member of each group came third (R1C3 came third in the first race, R2C3 came third in the second race and so on). \n\nNext, we race the 5 level 1 winners (R1C5, R2C5, R3C5, R4C5 and R5C5). Let's say R1C5 wins this race, R2C5 comes second and R3C5 comes third. The winner of this race (R1C5) is the fastest horse of the entire group. Now, the horse which is second in the entire group can either be R2C5 or R1C4. The horse which is third in the entire group can either be R3C5, R2C4 or R1C3. Therefore, we race these 5 horses. Therefore, the horse R1C5 is the fastest horse. The horses which come first and second in the last race are the horses which are second and third in the entire group respectively. in this way, the minimum number of races required to determine the first, second and third horses in the entire group is 7. \n ",
        "original_answer": "7",
        "original_domain": "int",
        "unpuzzle": "You have 25 horses and need to find the three fastest horses. You can race twenty-five horses at a time, but you do not have a stopwatch. What is the minimum number of races required to determine the three fastest horses?",
        "unpuzzle_solution": "Put all the horses in one race: the three fastest will be the top three finishers in this race.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A tech company has built 25 prototype drones and wants to determine which three are the fastest.  \\nThe test field allows you to launch up to 25 drones in a single flight, and there is no speed-tracking equipment—after each flight you only know the finishing order of the drones that flew.  \\nWhat is the smallest number of flights required to be certain of the three quickest drones?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-9-find-the-fastest-3-horses/"
    },
    {
        "puzzle_name": "The Three Cannibals and Three Missionaries Problem",
        "original_puzzle": "Three missionaries and three cannibals need to cross a river using a boat that can hold at most two people. If the cannibals ever outnumber the missionaries on either side of the river, they will eat them. What is the minimum number of trips needed?",
        "original_solution": "1. Send two cannibals.\n2. Send one cannibal back.\n3. Send two cannibals.\n4. Send one cannibal back.\n5. Send two missionaries.\n6. Send one missionary and one cannibal back.\n7. Send two missionaries.\n8. Send one cannibal back.\n9. Send two cannibals.\n10. Send one cannibal back.\n11. Send two cannibals.",
        "original_answer": "11",
        "original_domain": "int",
        "unpuzzle": "Three missionaries and three cannibals need to cross a river using a boat that can hold at most six people. If the cannibals ever outnumber the missionaries on either side of the river, they will eat them. What is the minimum number of trips needed?",
        "unpuzzle_solution": "Only one trip is needed since the boat is big enough to fit everyone at once.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "At a distant asteroid outpost, three scientists and three space raiders must relocate from the surface up to their orbiting shuttle using a single lift-capsule that can carry no more than six passengers at a time. If, at any moment on the surface or inside the shuttle, the raiders outnumber the scientists, the scientists will be taken hostage. What is the minimum number of capsule trips required to get everyone aboard the shuttle safely?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://en.wikipedia.org/wiki/Missionaries_and_cannibals_problem"
    },
    {
        "puzzle_name": "Three Locked Boxes",
        "original_puzzle": " You have three boxes, one containing gold. Each box has a statement written on it. Only one statement is true.    * Box 1: \"The gold is not here.\"    * Box 2: \"The gold is not here.\"    * Box 3: \"The gold is in Box 2.\"    Which box contains the gold?",
        "original_solution": "\"To determine where the gold is, check which configuration allows exactly one statement to be true:\n\n1. Suppose the gold is in Box 1:  \n   • Box 1 says “The gold is not here.” This would be false.  \n   • Box 2 says “The gold is not here.” This would be true (since the gold is in Box 1).  \n   • Box 3 says “The gold is in Box 2.” This would be false.  \n   Here, exactly one statement is true (the one on Box 2).\n\n2. Suppose the gold is in Box 2:  \n   • Box 1 says “The gold is not here.” True.  \n   • Box 2 says “The gold is not here.” False.  \n   • Box 3 says “The gold is in Box 2.” True.  \n   That makes two statements true, which contradicts the puzzle’s requirement.\n\n3. Suppose the gold is in Box 3:  \n   • Box 1 says “The gold is not here.” True.  \n   • Box 2 says “The gold is not here.” True.  \n   • Box 3 says “The gold is in Box 2.” False.  \n   That makes two statements true, violating the condition.\n\nOnly when the gold is in Box 1 do we get exactly one true statement. Therefore, the gold is in Box 1.\"",
        "original_answer": "1",
        "original_domain": "int",
        "unpuzzle": "You have three boxes, one containing gold. Each box has a statement written on it. All statements are true.  Box 1: \"The gold is not here.\"  Box 2: \"The gold is  here.\" Box 3: \"The gold is in Box 2.\"    Which box contains the gold?",
        "unpuzzle_solution": "Box 2 clearly indicates it holds the gold; the other two statements do not contradict this statement.",
        "unpuzzle_answer": "2",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "You\\'re searching for a hidden artifact within three ancient urns. Each urn bears an inscription, and you know all the inscriptions are accurate. Urn Alpha: \"The artifact isn\\'t inside me.\" Urn Beta: \"The artifact is inside me.\" Urn Gamma: \"The artifact resides within Urn Beta.\" Which urn holds the hidden artifact?",
        "shifted_unpuzzle_answer": "2",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "Duck Counting",
        "original_puzzle": "There are two ducks in front of a duck, two ducks behind a duck and a duck in the middle. How many ducks are there?",
        "original_solution": "Three: one duck in front, one in the middle, and one behind.",
        "original_answer": "3",
        "original_domain": "int",
        "unpuzzle": "There are two ducks in front of the chicken, two ducks behind the chicken, and a duck to the left of the chicken. How many ducks are there?",
        "unpuzzle_solution": "The chicken in the middle with two ducks in front of it, two ducks behind of it, and one duck to the left of it. This total 5 ducks.",
        "unpuzzle_answer": "5",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "During a seaside procession, a bright lighthouse float moves along the pier. Two brass bands march in front of the float, two brass bands march behind the float, and one brass band marches to the left of the float. How many brass bands are in the procession?",
        "shifted_unpuzzle_answer": "5",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "Searching for Marriage",
        "original_puzzle": "Jack is looking at Anne. Anne is looking at George. Jack is married, George is not, and we don’t know if Anne is married. Is a married person looking at an unmarried person?",
        "original_solution": "If Anne is married, then she is looking at an unmarried George so the answer is yes. If Anne is not married, than a married Jack is looking at her so the anwer is also yes.",
        "original_answer": " ",
        "original_domain": "int",
        "unpuzzle": "Jack is looking at Anne. Anne is looking at George. Jack is not married, Anne is not married, and we don’t know if George is married. George is not looking at anyone. Is a married person looking at an unmarried person? Please answer yes or no.",
        "unpuzzle_solution": "Jand and Ann are the only people looking at another person, and neither is married. Hence, no married person is looking at anyone else, unmarried or otherwise.",
        "unpuzzle_answer": "no",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "There are three computers, and each computer may be operating normally or failing. Computer A provides input to computer B, and computer B provides input to computer C. Computer A and B are operating normally, but we do not know the status of comuter C. Is failing computer providing input to a computer that is operating normally?",
        "shifted_unpuzzle_answer": "no",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "More Socks",
        "original_puzzle": "A man has 53 socks in his drawer: 21 identical blue, 15 identical black and 17 identical red. The lights are out and he is completely in the dark. How many socks must he take out to make 100 percent certain he has at least one pair of black socks?",
        "original_solution": "The worst case is if the man takes out every non-black socks before the second black sock; this would by 1 + 21+17 socks, so the 40th sock would be black.",
        "original_answer": "40",
        "original_domain": "int",
        "unpuzzle": "A man has 53 socks in his drawer: 21 identical blue, 15 identical black and 17 identical red. There is no distinction between left and right socks. The lights are out and he is completely in the dark. How many socks must he take out to have one sock for each foot?",
        "unpuzzle_solution": "The man only wants 2 socks and does not place any restriction on the color. Hence, any two socks will do.",
        "unpuzzle_answer": "2",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A baker has a bin containing 53 cookies: 21 chocolate chip, 15 oatmeal raisin, and 17 peanut butter.  A customer wants a snack, and doesn't care about the flavor.  Without looking, how many cookies must the baker grab to guarantee they have at least one cookie for each hand?",
        "shifted_unpuzzle_answer": "2",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "Lion and Unicorn",
        "original_puzzle": "A girl meets a lion and unicorn in the forest. The lion lies every Monday, Tuesday and Wednesday and the other days he speaks the truth. The unicorn lies on Thursdays, Fridays and Saturdays, and the other days of the week he speaks the truth. “Yesterday I was lying,” the lion told the girl. “So was I,” said the unicorn. What day is it?",
        "original_solution": "We know he Lion lies on Mon/Tue/Wed and tells the truth on Thu/Fri/Sat/Sun; the Unicorn lies on Thu/Fri/Sat and tells the truth on Sun/Mon/Tue/Wed.\n\nThey say:\n1) Lion: “Yesterday I was lying.”  \n2) Unicorn: “So was I.” (i.e., “I, too, was lying yesterday.”)\n\nIn is easy to verify that the two conditions are consistent on Thursday:\n– The Lion tells the truth on Thursday, so his statement “Yesterday I was lying” must be true.  This implies that The Lion was lying on Wednesday (which is correct, since Wed is a lying day for the Lion).  \n– The Unicorn lies on Thursday, so his statement “I was lying yesterday” must be false. This implies that the Unicorn was not lying on Wednesday (which is correct, since Wed is a truth day for the Unicorn).  \n\nOne can also check that no other day works.",
        "original_answer": "Thursday",
        "original_domain": "Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday",
        "unpuzzle": "A girl meets a lion and unicorn in the forest. The lion lies every Monday, Tuesday and Wednesday and the other days he speaks the truth. The unicorn lies on Thursdays, Fridays and Saturdays, and the other days of the week he speaks the truth. “Today I am telling the truth. Yesterday, the unicorn was lying,” the lion told the girl. “I agree” said the unicorn. What day is it?",
        "unpuzzle_solution": "If the lion is telling the truth, then today must be Sunday. On sundays, the Unicorn tells the truth and would only agree with the lion if the lion was truthful.\n\nIf the lion is lying, then it must be Monday, Tuesday, or Wednesday. On these days, the Unicorn tells the truth so the unicorn would not agree with the lion. Hence, today must be Sunday.",
        "unpuzzle_answer": "Sunday",
        "unpuzzle_domain": "Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday",
        "shifted_unpuzzle": "During a deep-space voyage, an exploration robot (Rex) and a maintenance android (Andy) chat with an astronaut.  \\nRex’s circuitry makes him dishonest every Monday, Tuesday and Wednesday; on the other four days he is perfectly truthful.  \\nAndy, on the other hand, malfunctions every Thursday, Friday and Saturday, causing him to lie; on the remaining days he always tells the truth.\\n\\nRex announces, “Today I am speaking truthfully, and yesterday Andy was lying.”  \\nAndy immediately adds, “That statement checks out.”\\n\\nOn what day of the week is this conversation taking place?",
        "shifted_unpuzzle_answer": "Sunday",
        "shifted_unpuzzle_domain": "Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday",
        "source": " "
    },
    {
        "puzzle_name": "River crossing with a weight constraints",
        "original_puzzle": "Four people (Alex, Brook, Chris and Dusty) want to cross a river in a boat that can only carry 100kg. Alex weighs 90kg, Brook weighs 80kg, Chris weighs 60kg and Dusty weighs 40kg, and they have 20kg of supplies. What is the minimum number of river crossings they need to get across?",
        "original_solution": "There may be a couple variations that will work, but here’s one way: Chris and Dusty row across (combined 100kg), Dusty returns. Alex rows over, and Chris returns. Chris and Dusty row across again, Dusty returns. Brook rows across with the supplies (combined 100kg), and Chris returns. Chris and Dusty row across again.",
        "original_answer": "7",
        "original_domain": "int",
        "unpuzzle": "Four people (Alex, Brook, Chris and Dusty) want to cross a river in a boat that can only carry 300kg. Alex weighs 90kg, Brook weighs 80kg, Chris weighs 60kg and Dusty weighs 40kg, and they have 20kg of supplies. What is the minimum number of river crossings they need to get across?",
        "unpuzzle_solution": "The weight of everybody totals 300kg, so they can all fit in the boat and cross in a single trip.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "During a night mission, four secret agents—Nightshade (90 kg), Viper (80 kg), Ghost (60 kg) and Whisper (40 kg)—must ride a silent electric trolley across a guarded courtyard. The trolley’s maximum load is exactly 300 kg, and the team is also carrying a 20 kg crate of encrypted files that must travel with them. How many trolley trips (back-and-forth crossings of the courtyard) are needed to get everyone and the crate to the far side?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/four-adventurers-and-a-small-canoe.html"
    },
    {
        "puzzle_name": "Tennis winnings",
        "original_puzzle": "Susan and Lisa decided to play tennis against each other. They bet $1 on each game they played. Susan won three bets and Lisa won $5. How many games did they play?",
        "original_solution": "They played 11 games. Lisa's winning of $5 means that she won 5 more games than she lost. If Susan won 3 games, this means that Lisa must have won 3 + 5 games. In total, this makes 11 games: three that Susan won, and 8 that Lisa won.",
        "original_answer": "11",
        "original_domain": "int",
        "unpuzzle": "Susan and Lisa decided to play tennis against each other. They bet $1 on each game they played. Susan won three bets and lisa lost $3. How many games did they play?",
        "unpuzzle_solution": "Susan won three games, which means that lisa lost $3.",
        "unpuzzle_answer": "3",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "On a long train ride, Alex and Jordan decide to play successive rounds of rock-paper-scissors to pass the time. For every round, the winner receives one souvenir token from the loser. By the time they stop, Alex has gained three tokens and Jordan’s collection is smaller by three tokens. How many rounds did they contest in total?",
        "shifted_unpuzzle_answer": "3",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "Cutting a chocolate bar",
        "original_puzzle": "How many steps are required to break an m × n sized bar of chocolate into 1 × 1 pieces? You can break an existing piece of chocolate horizontally or vertically. You cannot break two or more pieces at once (so no cutting through stacks).",
        "original_solution": "You need m × n − 1 steps. By breaking an existing piece horizontally or vertically, you merely increase the total number of pieces by one. You already have 1 piece, so need m × n − 1 steps to get to m × n pieces.",
        "original_answer": "m * (n-1) steps",
        "original_domain": "int",
        "unpuzzle": "How many steps are required to break an m × n sized bar of chocolate into m × 1 pieces? You can break an existing piece of chocolate horizontally or vertically. You cannot break two or more pieces at once (so no cutting through stacks).",
        "unpuzzle_solution": "Every cut increases the number of pieces by 1. The bar is divided into n pieces of size m x 1 pieces; we therefore need n-1 cuts.",
        "unpuzzle_answer": "n-1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A tailor is working with a rectangular sheet of cloth that measures m squares tall by n squares wide. She must slice the cloth into narrow ribbons, each ribbon being m squares tall and 1 square wide, so that she ends up with exactly n identical ribbons. On any single snip she may cut one current piece of cloth straight across, either all the way vertically or all the way horizontally, but her scissors cannot pass through two separate pieces at once. What is the minimum number of snips she needs to produce all the required ribbons?",
        "shifted_unpuzzle_answer": "n-1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/breaking-up-a-chocolate-bar.html"
    },
    {
        "puzzle_name": "Egg drop",
        "original_puzzle": "You are in a 100-story building and have two identical eggs. You need to find the highest floor from which an egg can be dropped without breaking. What is the maximum number of drops needed for a strategy that minimizes the worst-case number of drops?",
        "original_solution": "Let us make our first attempt on x'th floor. \n\nIf it breaks, we try remaining (x-1) floors one by one. \nSo in worst case, we make x trials.\n\nIf it doesn't break, we jump (x-1) floors (Because we have\nalready made one attempt and we don't want to go beyond \nx attempts.  Therefore (x-1) attempts are available),\n    Next floor we try is floor x + (x-1)\n\nSimilarly, if this drop does not break, next need to jump \nup to floor x + (x-1) + (x-2), then x + (x-1) + (x-2) + (x-3)\nand so on.\n\nSince the last floor to be tried is 100'th floor, sum of\nseries should be 100 for optimal value of x.\n\n x + (x-1) + (x-2) + (x-3) + .... + 1  = 100\n\n x(x+1)/2  = 100\n         x = 13.651\n\nTherefore, we start trying from 14'th floor. If Egg breaks on 14th floor\nwe one by one try remaining 13 floors, starting from 1st floor.  If egg doesn't break\nwe go to 27th floor.\nIf egg breaks on 27'th floor, we try floors form 15 to 26.\nIf egg doesn't break on 27'th floor, we go to 39'th floor.\n\nAn so on...",
        "original_answer": "14",
        "original_domain": "int",
        "unpuzzle": "You are in a 100-story building and have a single egg. You need to find the highest floor N from which an egg can be dropped without breaking. What's the minimum number of drops needed for a strategy that minimizes the worst-case number of drops?",
        "unpuzzle_solution": "Because there is only one egg, we must drop it from one floor higher than the highest floor N; otherwise, we can never learn N. We must start at the ground floor and work up, which has a worst number of drops of 100.",
        "unpuzzle_answer": "99",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "You are sampling berries in a forest known to have poisonous berries above a certain height on the bushes. You can only eat one poised berry before you become sick.  The bushes in this section of the forest grow up to 100 segments tall. What is the minimum number of tastes needed to guarantee you find the highest safe segment from which you can pick a non-poisonous berry?",
        "shifted_unpuzzle_answer": "99",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-set-35-2-eggs-and-100-floors/"
    },
    {
        "puzzle_name": "Clocks",
        "original_puzzle": "How many times a day do the hour and minute hands of a clock overlap?",
        "original_solution": "The overlap will happen 11 times in a 12 hour period and so the answer is just 1/11th of 12 hours. It's difficult to divine this. But it makes sense. Just as we reasoned our first overlap will be at just after 1:05 we can reason that our last will be just before 10:55. Our overlaps will be at just after 1:05, a bit more after 2:10, even more after 3:15 and so on (actual times give at the end) but since our last is a bit before 10:55 there will be no overlap whilst the Hour Hand is indicating 11.",
        "original_answer": "25",
        "original_domain": "int",
        "unpuzzle": "How many times a day do the hour and minute hands of a clock stopped at 1pm overlap?",
        "unpuzzle_solution": "None: the hour and minute hand do not overlap at 1pm.",
        "unpuzzle_answer": "0",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A gauge has two needles; one is stuck at 12pm, and the other is stuck at 1pm. Over the course of a day, how many times do they overlap?",
        "shifted_unpuzzle_answer": "0",
        "shifted_unpuzzle_domain": "int",
        "source": "https://puzzles.nigelcoldwell.co.uk/thirtyfive.htm"
    },
    {
        "puzzle_name": " The 100 Prisoners with boxes",
        "original_puzzle": "100 prisoners are each assigned a random number from 1-100. In a room, there are 100 boxes numbered 1-100, each containing one of these numbers. Each prisoner may open up to 50 boxes to find their number. If ALL prisoners find their number, they all go free. If ANY fail, they all die. What is the highest probability with which they can guarantee that everyone goes free, rounded to the nearest percent?",
        "original_solution": "The optimal strategy gives them a ~31% chance of survival: Each prisoner starts with their assigned number's box. If their number isn't inside, they open the box number they found, continuing this \"loop\" up to 50 times. This works because the boxes form loops, and if no loop is longer than 50, everyone succeeds.",
        "original_answer": "31",
        "original_domain": "int",
        "unpuzzle": "100 prisoners are each assigned a random number from 1-100. In a room, there are 100 boxes numbered 1-100, each containing one of these numbers. Each prisoner may open up to 100 boxes to find their number. If ALL prisoners find their number, they all go free. If ANY fail, they all die. What is the highest probability with which they can guarantee that everyone goes free?",
        "unpuzzle_solution": "Since each prisoner can open 100 boxes, each prisoner can open every singe box. This guarantees that every prisoner finsd their number and they all go free with probability 1.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A baker has baked 50 different types of cookies. He arranges them on a display with 50 labeled sections, one type of cookie per section. 50 customers enter the bakery, each with a ticket listing their desired cookie type.  Each customer is allowed to check up to 50 sections of the display. If every customer finds their desired cookie type, the baker wins a prize. What is the highest probability the baker can ensure he wins the prize?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://en.wikipedia.org/wiki/100_prisoners_problem"
    },
    {
        "puzzle_name": "Handshake Problem",
        "original_puzzle": "A woman and her husband attended a party with four other couples. As is normal at parties, handshaking took place. Of course, no one shook their own hand or the hand of the person they came with. And not everyone shook everyone else's hand. But when the woman asked the other (9) people present how many different people's hands they had shaken they all gave a different answer. Question (this is NOT a trick!): How many different people's hands did the woman's husband shake?",
        "original_solution": "There are ten people, and no one shook more than 8 hands. If everyone the woman asked provided a different number, then there must be some one who shook 0, 1, 2, 3, 4, 5, 6, 7, and 8 hands. We begin by concluded that the person that shook 8 shook hands with everyone except for his or her spouse, implying that everyone except must have shaken hands at least once; hence, the person who shook 8 hands and the person who shook 0 hands are married. If we then example the remaining 4 couples and ignore the hand shaking with the first couple, we can conclude that the person who shook 7 hands and 1 hand are also married. By incuction, this means that 0 and 8, 7 and 1, 6 and 2, 5 and 3 are married. The last couple both shook 4 people's hands. Since the woman in question recieved different aswers from everyone, that means that she must be from the couple that shook 4 hands. Hence, her husband shook 4 hands.",
        "original_answer": "4",
        "original_domain": "int",
        "unpuzzle": "A woman and her husband attended a party with three other couples. As is normal at parties, handshaking took place. Of course, no one shook their own hand or the hand of the person they came with. But when the woman asked every the other six people who were not her husband how many different people's hands they had shaken they all gave the same answer, six. Question (this is NOT a trick!): How many different people's hands did the woman's husband shake?",
        "unpuzzle_solution": "Because no one shook hands with their partner or themselves, the maximum number of hands anyone could have shook is six. Since everyone shook 6 hands the maximum number of people. This means, in particular, that the woman's husband shook hands with 6 people as well.",
        "unpuzzle_answer": "6",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A queen organized a grand ball attended by three other noble families, each consisting of a lord and a lady. During the festivities, guests exchanged formal bows. Naturally, no one bowed to themselves or their spouse. Later, the queen inquired with each of the other six nobles (excluding her king) about how many different nobles they had bowed to. Remarkably, they all gave the same answer: six. How many different nobles did the queen's king bow to?",
        "shifted_unpuzzle_answer": "6",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "Conjunctive Fallacy",
        "original_puzzle": "Linda is 31 years old, single, outspoken, and very bright. She majored in philosophy. As a student, she was deeply concerned with issues of discrimination and social justice, and also participated in anti-nuclear demonstrations. Which is more probable? A) Linda is a bank teller. B) Linda is a bank teller and is active in the feminist movement. Please respond with a single letter, either A or B.",
        "original_solution": "Event B has strictly more conditions, so it must not have greater probability.",
        "original_answer": "A",
        "original_domain": "A, B",
        "unpuzzle": "Linda is 31 years old, single, outspoken, and very bright. She majored in philosophy. As a student, she was deeply concerned with issues of discrimination and social justice, and also participated in anti-nuclear demonstrations. She is active in the feminist movement. Which is more probable? A) Linda is a bank teller. B) Linda is active in the feminist movement. Please respond with a single letter, either A or B.",
        "unpuzzle_solution": "Linda might be a bank teller, so A) happens with some non-zero probablility. However, we know that Linda was active in thet feminist movement, so B) happens with certainty and is therefore more likely.",
        "unpuzzle_answer": "B",
        "unpuzzle_domain": "A, B",
        "shifted_unpuzzle": "Elara, a seasoned explorer in her late 40s, has charted numerous unexplored territories. Known for always meticulous planning her expiditions, she often spends months in remote wilderness areas. During her expeditions, she prioritizes documenting rare flora and fauna and maintaining detailed geological surveys.  Which is more probable? A) Elara carries a compass. B) Elara meticulously plans her expeditions.",
        "shifted_unpuzzle_answer": "B",
        "shifted_unpuzzle_domain": "A, B",
        "source": "https://en.wikipedia.org/wiki/Conjunction_fallacy"
    },
    {
        "puzzle_name": "Wine/water mixing",
        "original_puzzle": "Start with two barrels, one holding wine and the other an equal volume of water. A cup of wine is taken from the wine barrel and added to the water. A cup of the wine/water mixture is then returned to the wine barrel, so that the volumes in the barrels are again equal. Which barrel is purer? Please answer with \"wine,\" \"water,\" or \"equal.\"",
        "original_solution": "They both end up with exactly the same proportion of “foreign” liquid. To see why, notice that whatever fraction of water migrates into the wine barrel must be replaced by an equal fraction of wine that remains in the water barrel. Consequently, each barrel contains the same amount of “contamination” from the other, so they are equally pure.",
        "original_answer": "equal",
        "original_domain": "wine, water, equal",
        "unpuzzle": "Start with two barrels, one holding wine and the other an equal volume of water. A cup of wine is added to the water barrel. A cup of wine is then added to the wine barrel, so that the volumes in the barrels are again equal. Which barrel is purer? Please answer with \"wine,\" \"water,\" or \"equal.\"",
        "unpuzzle_solution": "The wine barrel is still completely wine, so it  has a different mixture.",
        "unpuzzle_answer": "wine",
        "unpuzzle_domain": "wine, water, equal",
        "shifted_unpuzzle": "Imagine two identical treasure chests. One chest contains only gold coins, and the other contains an equal number of silver coins. A handful of gold coins is taken from the gold chest and added to the silver chest. Then, a handful of gold coins is added back to the gold chest, returning the number of coins to its original count. Which chest now contains the purer collection of coins?",
        "shifted_unpuzzle_answer": "gold",
        "shifted_unpuzzle_domain": "gold, silver, equal",
        "source": "https://en.wikipedia.org/wiki/Wine/water_mixing_problem"
    },
    {
        "puzzle_name": "Word deduction",
        "original_puzzle": "A teacher writes six words on a board: “cat dog has max dim tag.” She gives three students, Albert, Bernard and Cheryl each a piece of paper with one letter from one of the words. Then she asks, “Albert, do you know the word?” Albert immediately replies yes. She asks, “Bernard, do you know the word?” He thinks for a moment and replies yes. Then she asks Cheryl the same question. She thinks and then replies yes. What is the word?",
        "original_solution": "Dog. Albert knows right away because he has one of the unique letters that only appear once in all the words: c o h s x i. So, we know the word is not “tag.” All of these unique letters appear in different words, except for “h” and “s” in “has,” and Bernard can figure out what the word is from the unique letters that are left: t, g, h, s. This eliminates “max” and “dim.” Cheryl can then narrow it down the same way. Because there is only one unique letter left, the letter “d,” the word must be “dog.” (For more on this answer, watch the video below.)",
        "original_answer": " ",
        "original_domain": "cat, doc, dog, god, cut, dud, dog, has, max, tim, tag",
        "unpuzzle": "A teacher writes six words on a board: “cat doc dog god, cut, dud.” She gives three students, Albert, Bernard and Cheryl each a piece of paper with one letter from one of the words. Then she asks, “Albert, do you know the word?” Albert immediately replies yes. She asks, “Bernard, do you know the word?” He thinks for a moment and replies yes. Then she asks Cheryl the same question. She thinks and then replies yes. What is the word?",
        "unpuzzle_solution": "A concise way to see why the word must be “cat” is to notice that “a” appears only in “cat” (it does not appear in any of the other five words). Since Albert instantly knows the word from his single letter, he must be holding “a.” Once Bernard and Cheryl realize Albert’s letter must be “a,” they both deduce that the only possible word is “cat.”",
        "unpuzzle_answer": "cat",
        "unpuzzle_domain": "cat, doc, dog, god, cut, dud, dog, has, max, tim, tag",
        "shifted_unpuzzle": "During a spy-school drill, Instructor Vega flashes six possible codewords on a big screen:  \\n“doc, dog, god, cut, dud, cat.”  \\nShe secretly chooses one of these six words and tears it into its three letters, slipping one letter into an envelope for each of the three cadets—Aria, Blake, and Carlos.  \\nEach cadet sees only the single letter in their own envelope.\\n\\nThe instructor then asks:  \\n“Aria, do you know the codeword?”  \\nAria glances at her letter and immediately answers, “Yes.”\\n\\nTurning to Blake, the instructor asks the same question. Blake thinks for a moment and then says, “Yes.”\\n\\nFinally, Carlos is asked whether he knows the codeword. After a brief pause, he also replies, “Yes.”\\n\\nAssuming every cadet reasons perfectly and tells the truth, what was the instructor’s secret codeword?',",
        "shifted_unpuzzle_answer": "cat",
        "shifted_unpuzzle_domain": "cat, doc, dog, god, cut, dud, dog, has, max, tim, tag",
        "source": "https://www.geeksforgeeks.org/aptitude-gq/puzzle-secret-word/"
    },
    {
        "puzzle_name": "Pet Show",
        "original_puzzle": "At the Pet Show recently I noticed that all except two of the entries were cats, all except two were dogs, and all except two were fish. How many dogs were at the Pet Show?",
        "original_solution": "There are one fish, one cat, and one dog.",
        "original_answer": "1",
        "original_domain": "int",
        "unpuzzle": "At the Pet Show for mammals recently I noticed that all except two of the entries were cats, all except two were dogs. How many fish were at the Pet Show?",
        "unpuzzle_solution": "No fish are allowed in the mammal pet show, so there are zero fish.",
        "unpuzzle_answer": "0",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "At the Solar-Powered Vehicle Expo, where only sun-charged machines were permitted, I noticed that all except two of the entries were solar cars, and all except two were solar motorcycles. How many diesel buses were on display?',",
        "shifted_unpuzzle_answer": "0",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/pet-show.html"
    },
    {
        "puzzle_name": "Sailing Athletes",
        "original_puzzle": "There are three Athletes (Alex, Brook and Chris) and their individual Coaches (Murphy, Newlyn and Oakley) standing on the shore. No Coach trusts their Athlete to be near any other Coach unless they are also with them. There is a boat that can hold a maximum of two persons. What is the minimum number of crossings necessary to bring everyone over to the other side of the river?",
        "original_solution": "Alex and Brook cross, then Alex returns. Next, Alex and Chris cross, then Chris returns. Afterwards, coaches Murphy and Newlyn cross to join their Athletes, and Brook and Newlyn return. Then Newlyn and Oakley cross, so all three coaches are across as well as Alex. Then Alex returns and Alex and Brook cross. Finally,  Coach Oakley returns and Chris and Coach Oakley cross. Any permutation of coaches and athletes would also be a valid solution.",
        "original_answer": "9",
        "original_domain": "int",
        "unpuzzle": "There are three Athletes (Alex, Brook and Chris) and their individual Coaches (Murphy, Newlyn and Oakley) standing on the shore and want to get to the other side of the river. No Coach trusts their Athlete to be near any other Coach unless they are also with them. There is a boat that can hold a maximum of six persons.  What is the minimum number of crossings necessary to bring everyone over to the other side of the river?",
        "unpuzzle_solution": "Because the boat can hold six people, all coaches and athletes travel across the river at once and only one trip is needed.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Three Royal Guards (Arthur, Bartholomew, and Charles) and their respective Princes (Edward, Ferdinand, and George) need to evacuate the castle and reach the hidden escape tunnel located across the chasm. No Prince is permitted to be in the presence of a Royal Guard who is not their own, unless their own Royal Guard is also present. The royal carriage can accommodate a maximum of six individuals. What is the minimum number of carriage trips needed to transport everyone to the escape tunnel?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/three-coaches-three-athletes-and-a-river.html"
    },
    {
        "puzzle_name": "Egg Timer",
        "original_puzzle": "You need to boil eggs for exactly 9 minutes, or else the visiting Duchess will complain, and you will lose your job as head chef. But you have only 2 Hourglasses, one measures 7 minutes, and the other measures 4 minutes. What is the minimum number of hourglass flips you need to be able to correctly measure 9 minutes?",
        "original_solution": "Start both timers. When the 4 minute timer runs out, flip it. When 7 minute timer runs out, also flip it. When 4 min timer runs out a second time, 8 minutes will have passed so only 1 minute on the 7-minute timer will have ellapsed: flip this timer back over. When the 1 minute runs out, a total of 9 minutes will have ellapsed: 4 from the first flip of the 4 minute timer, 4 from the second flip of the 4 minute timer, and 1 from the partially flipped 7 minute timer: this totals 9 minutes in total.",
        "original_answer": "4",
        "original_domain": "int",
        "unpuzzle": "You need to boil eggs for exactly 9 minutes, or else the visiting Duchess will complain, and you will lose your job as head chef. But you have only 2 hourglasses, one measures 5 minutes, and the other measures 4 minutes. What is the minimum number of hourglass flips needed be able to time 9 minutes?",
        "unpuzzle_solution": "Start one hourglass, then start the second hourglass as soon as the first one runs out. When the second hour glass runs out, a total of 5+4=9 minutes will have passed.",
        "unpuzzle_answer": "2",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A galactic navigation officer needs to activate a hyperdrive for exactly 13 chronons, otherwise the hyperspace jump will fail, and their ship will be lost. They have two space energy timers; once activated, an energy timer will increment energy and emit a signal until it's calibrated level is reach, but the timer can be activated again to cause it to decrement stored eneregy at the same rate instead. One timer is calibrated to emit a signal for 7 chronons, and the other for 6 chronons. What is the minimum number of energy timer activations needed to accurately time 13 chronons?",
        "shifted_unpuzzle_answer": "2",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/hourglasses-1.html"
    },
    {
        "puzzle_name": "Flying around the world",
        "original_puzzle": "You intend to fly non-stop around the world, but a full tank only takes you halfway around the world. However, you can arrange many planes exactly like yours to assist with refueling. You can only use the starting airport, and refueling can be done midair. Ignoring refueling and turn-around times, what is the minimum number of planes you will need?",
        "original_solution": "You need three planes. Two planes cannot suffice because you need to transfer 1 tank of fuel to the first plane sometime on the opposite side of the world. One plane cannot do this, since it needs to fly to the opposite side of the world and back and still have extra fuel to give; just the return journey would take a whole tank.\n\nYou can accomplish the task with three planes.  Start three planes from the airport (yours and two others). After going 1/8 around, one plane refuels both yours and the other plane with 1/4 of a tank each, leaving it with 1/4 of a tank which is precisely enough to take it home.\n\nTwo planes continue with a full tank again.\n\nReaching 1/4 around the other plane transfers 1/4 tank of fuel to yours, leaving it with 1/2 tank, to take it precisely home again.\n\nYour plane is now full at 1/4 and can go to 3/4 with that fuel.\n\nThe first returning plane refuels and start off the other way meeting your plane at its 3/4 position, where your plane is empty and the meeting one is half empty. Sharing their fuel they have both 1/4 tank left which can take them to the 7/8 position.\n\nThe remaining plane has arrived there in the meanwhile with 3/4 tank giving 1/4 to the other now empty planes.\n\nAll three planes have now 1/4 and can return home.",
        "original_answer": "3",
        "original_domain": "int",
        "unpuzzle": "You intend to fly non-stop around the world, but a full tank only takes you halfway around the world. However, you can arrange many planes exactly like yours to assist with refueling. You can only use the starting airport, an airport on the opposite side of the planet, and refueling can be done midair or at airports. Ignoring refueling and turn-around times, what is the minimum number of planes you will need?",
        "unpuzzle_solution": "Simple fly to the airport, using the entire tank, refuel, then use the second tank to complete your journey.",
        "unpuzzle_answer": "2",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A lone explorer needs to walk a complete loop around a vast dessert, but nothing can enter the dessert for fear of quicksand. Their water canteen holds enough water for half the desert crossing loop. They can arrange for identical supply caravans to assist with resupply. These caravans can transfer water mid-journey.  Ignoring travel time and transfer time, what is the minimum number of caravans needed to ensure the explorer completes the loop?",
        "shifted_unpuzzle_answer": "2",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/planes-around-the-world.html"
    },
    {
        "puzzle_name": "Chameleon matching",
        "original_puzzle": "13 purple, 15 yellow, and 17 maroon chameleons are found on an island. When two different-coloured chameleons come together, they both turn into the third colour. Can all chameleons eventually have the same hue after a certain number of pairwise meetings?",
        "original_solution": "As per the question, whenever 2 chameleons of different colours meet, both of them get converted into the third colour chameleon, which means that the number of Chameleons of the two colours (which met) decreases by 1, whereas the number of chameleons of the third colour (they converted into after meeting) increases by 2. \nLet us denote the chameleons of different colours purple, yellow and maroon by p, y and m respectively, and then the initial state is (13, 15, 17). \nNow, let us suppose that initially, a purple and maroon meet. The vector changes to (12, 17, 16) and after continuing, we would get to this state (0, 41,4). \nWhen Yellow and Maroon meet first : (15, 14, 16) and after continuing, the end state is (43, 0, 2).\nWhen Purple and Yellow meet first: (12, 14, 19)and after continuing, the end state is (0, 2, 43).\nTherefore, we observe that the difference between the Chameleons of two different colours is never going to be 0, and in the absence of such a scenario we can't get all the Chameleons to turn into one single colour.",
        "original_answer": "no",
        "original_domain": "yes, no",
        "unpuzzle": "15 purple, 15 yellow, and 17 maroon chameleons are found on an island. When two different-coloured chameleons come together, they both turn into the third colour. Can all chameleons eventually have the same hue after a certain number of pairwise meetings?",
        "unpuzzle_solution": "If every one of the 15 purple chameleons goes on a date with one of the 15 yellow chameleons, they will all turn into 30 maroon chameleons. Thus, every chameleon will have the same hue.",
        "unpuzzle_answer": "yes",
        "unpuzzle_domain": "yes, no",
        "shifted_unpuzzle": "There are 31 Spurs fans, 31 Arsenal fans, and 49 Chelsea fans. Everytime fans of two different sports teams meat, they realize they are both wrong and become fans of the third team. Is it possible that, after a certain number of pairwise meetings, everyone is a fan of one team?",
        "shifted_unpuzzle_answer": "yes",
        "shifted_unpuzzle_domain": "yes, no",
        "source": "https://www.geeksforgeeks.org/puzzle-chameleons-go-on-a-date/"
    },
    {
        "puzzle_name": "Six Houses PQRSTU",
        "original_puzzle": "There are three houses on each side of the road. These six houses are labeled as P, Q, R, S, T, and U. The houses are of different colors, namely, Red, Blue, Green, Orange, Yellow, and White. The houses are of different heights.\nT, the tallest house, is exactly opposite to the Red-colored house.\nThe shortest house is exactly opposite to the Green colored house.\nU, the Orange colored house, is located between P and S.\nR, the Yellow-colored house, is exactly opposite to P.\nQ, the Green colored house, is exactly opposite to U.\nP, the white-colored house, is taller than R, but shorter than S and Q.\nWhat is the color of the tallest house?",
        "original_solution": "From the given information the tallest house is T and it is opposite to the Red-colored house. and the Shortest house is exactly opposite to the Green colored house.\nThe color of the house U is Orange and it is situated between P and S. It implies that houses P, S, and U are on one side of the road and the other three houses, namely, Q, R, and T are on another side of the road. P, S, and U can be placed in two ways. One way is {P, U, S}, and another way is {S, U, P}. \nThe color of the house R is Yellow and it is opposite to P. \nThe color of the house Q is Green and it is opposite of U. The shortest house is exactly opposite to the Green colored house it means the shortest house is U. \nThe remaining house T, the tallest house, is opposite to S. The color of the house which is exactly opposite to T is Red. It means the color of S is Red. P, the white-colored house, is taller than R, but shorter than S and Q. The heights of P, Q, R, and S can be arranged in two ways. One of the ways is {S, Q, P, R} and another way is {Q, S, P, R}. \nTherefore, {P, U, S} are one side on the road, and {R, Q, T} are on another side of the road. P is opposite to R, U is opposite to Q and S is opposite to T. These two cases are shown below:",
        "original_answer": "Blue",
        "original_domain": "Red, Blue, Green, Orange, Yelow, White",
        "unpuzzle": "There are three houses on each side of the road. These six houses are labeled as P, Q, R, S, T, and U. The houses are of different colors, namely, Red, Blue, Green, Orange, Yellow, and White. The houses are of different heights.\nT, the tallest house, is exactly opposite to the Red-colored house.\nThe shortest house is exactly opposite to the Green colored house.\nU, the Orange colored house, is located between P and S.\nR, the Yellow-colored house, is exactly opposite to P.\nQ, the Green colored house, is exactly opposite to U.\nP, the white-colored house, is taller than R, but shorter than S and Q.\nWhat is the color of the house opposite to the tallest house?",
        "unpuzzle_solution": "Red: the problem description tells up that T, the tallest house, is exactly opposite to the Red-colored house.",
        "unpuzzle_answer": "Red",
        "unpuzzle_domain": "Red, Blue, Green, Orange, Yelow, White",
        "shifted_unpuzzle": "Three ancient temples stand in a row on the north side of a valley, mirrored by three more on the south side. These six temples are named Alpha, Beta, Gamma, Delta, Epsilon, and Zeta. Each temple is dedicated to a different celestial: Sun, Moon, Mars, Venus, Jupiter, and Saturn. Each temple also has a unique number of steps leading to its entrance.\\n\\nZeta, the temple with the most steps, faces the temple dedicated to the Sun.\\nThe temple with the fewest steps faces the temple dedicated to Mars.\\nEpsilon, the temple dedicated to Venus, is situated between Alpha and Delta.\\nGamma, the temple dedicated to Jupiter, faces Alpha.\\nBeta, the temple dedicated to Mars, faces Epsilon.\\nAlpha, the temple dedicated to Saturn, has more steps than Gamma, but fewer than Delta and Beta. What is the temple facing the temple with the most steps dedicated to?",
        "shifted_unpuzzle_answer": "Sun",
        "shifted_unpuzzle_domain": "Sun, Moon, Mars, Venus, Jupiter, Saturn",
        "source": "https://www.geeksforgeeks.org/puzzle-six-houses-p-q-r-s-t-and-u/"
    },
    {
        "puzzle_name": "Six Houses PQRSTU, v2",
        "original_puzzle": "There are three houses on each side of the road. These six houses are labeled as P, Q, R, S, T, and U. The houses are of different colors, namely, Red, Blue, Green, Orange, Yellow, and White. The houses are of different heights.\nT, the tallest house, is exactly opposite to the Red-colored house.\nThe shortest house is exactly opposite to the Green colored house.\nU, the Orange colored house, is located between P and S.\nR, the Yellow-colored house, is exactly opposite to P.\nQ, the Green colored house, is exactly opposite to U.\nP, the white-colored house, is taller than R, but shorter than S and Q.\nHow many houses are taller than the house R?",
        "original_solution": "From the given information the tallest house is T and it is opposite to the Red-colored house. and the Shortest house is exactly opposite to the Green colored house.\nThe color of the house U is Orange and it is situated between P and S. It implies that houses P, S, and U are on one side of the road and the other three houses, namely, Q, R, and T are on another side of the road. P, S, and U can be placed in two ways. One way is {P, U, S}, and another way is {S, U, P}. \nThe color of the house R is Yellow and it is opposite to P. \nThe color of the house Q is Green and it is opposite of U. The shortest house is exactly opposite to the Green colored house it means the shortest house is U. \nThe remaining house T, the tallest house, is opposite to S. The color of the house which is exactly opposite to T is Red. It means the color of S is Red. P, the white-colored house, is taller than R, but shorter than S and Q. The heights of P, Q, R, and S can be arranged in two ways. One of the ways is {S, Q, P, R} and another way is {Q, S, P, R}. \nTherefore, {P, U, S} are one side on the road, and {R, Q, T} are on another side of the road. P is opposite to R, U is opposite to Q and S is opposite to T. These two cases are shown below:",
        "original_answer": "4",
        "original_domain": "int",
        "unpuzzle": "There are three houses on each side of the road. These six houses are labeled as P, Q, R, S, T, and U. The houses are of different colors, namely, Red, Blue, Green, Orange, Yellow, and White. The houses are of different heights.\nT, the tallest house, is exactly opposite to the Red-colored house.\nThe shortest house is exactly opposite to the Green colored house.\nU, the Orange colored house, is located between P and S.\nR, the Yellow-colored house, is exactly opposite to P.\nQ, the Green colored house, is exactly opposite to U.\nP, the white-colored house, is taller than R, but shorter than S and Q. How many houses are taller than T?",
        "unpuzzle_solution": "T is the tallest house, so no houses are taller than it.",
        "unpuzzle_answer": "0",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Three ancient temples stand in a row on the north side of a valley, mirrored by three more on the south side. These six temples are named Alpha, Beta, Gamma, Delta, Epsilon, and Zeta. Each temple is dedicated to a different celestial body: Sun, Moon, Mars, Venus, Jupiter, and Saturn. Each temple also has a unique number of steps leading to its entrance.\\n\\nZeta, the temple with the most steps, faces the temple dedicated to the Sun.\\nThe temple with the fewest steps faces the temple dedicated to Mars.\\nEpsilon, the temple dedicated to Venus, is situated between Alpha and Delta.\\nGamma, the temple dedicated to Jupiter, faces Alpha.\\nBeta, the temple dedicated to Mars, faces Epsilon.\\nAlpha, the temple dedicated to Saturn, has more steps than Gamma, but fewer than Delta and Beta. How many temples have more steps than Zeta?',",
        "shifted_unpuzzle_answer": "0",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-six-houses-p-q-r-s-t-and-u/"
    },
    {
        "puzzle_name": "Melting candles",
        "original_puzzle": "There are two candles of equal lengths but of different thicknesses. The thicker candle lasts for 6 hours while the thinner one lasts for 2 hours less than the thicker one. A person lights the two candles at the same time and goes to play. After returning home, the person saw that the thicker candle was twice the length of the thinner one. How many hours ago did the person light the two candles?",
        "original_solution": "According to the problem statement, the thicker candle lasts for 6 hours while the thinner one lasts for 2 hours lesser than the thicker one.\nTherefore, the thinner candle lasts for 4 hours.\nThe problem reduces to finding the number of hours it takes for the thicker candle to become twice the length of the thinner candle.\nAnalyzing the problem hour by hour, after each hour (1/6) part of the thicker candle is melted while (1/4) part of the thinner candle is melted.\nAfter 1 hour, (5/6) part of the thicker candle remains while (3/4) part of the thinner candle remains.\nAfter 2 hours, (4/6) part of the thicker candle remains while (2/4) part of the thinner candle remains.\nAfter 3 hours, (3/6) part of the thicker candle remains while (1/4) part of the thinner candle remains.\nOn observing carefully, it can be found that at the end of 3 hours the remaining part of the thicker candle is (1/2) while it is (1/4) for the thinner candle i.e., the thicker candle is twice the length of the thinner one.",
        "original_answer": "3",
        "original_domain": "int",
        "unpuzzle": "There are two candles of equal lengths but of different thicknesses. The thicker candle lasts for 6 hours while the thinner one lasts for 2 hours less than the thicker one. A person lights the two candles at the same time and goes to play. After returning home, the person saw that the thinner candle had burned completely and the thicker candle was a sixth its length. How many hours ago did the person light the two candles?",
        "unpuzzle_solution": "The thicker candle burned for 5/6 its length, meaning that 5 hours had passed. The thinner candle would have burned through completely by this point.",
        "unpuzzle_answer": "5",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "At a remote observatory a physicist has two identical hourglasses that start with the same amount of sand, but their necks are drilled to different widths.  \\n• Hourglass A lets all its sand run through in exactly 6 hours.  \\n• Hourglass B, because of its wider neck, empties 2 hours sooner than Hourglass A.  \\n\\nThe physicist flips both hourglasses at the same instant and then steps outside to calibrate a telescope. When she returns she notices two things: Hourglass B is completely empty, while Hourglass A still retains exactly one-sixth of its original sand in the upper bulb. How many hours ago were the two hourglasses flipped?',",
        "shifted_unpuzzle_answer": "5",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/melting-candles-puzzle/"
    },
    {
        "puzzle_name": "Circle of Lights",
        "original_puzzle": "There is a circle of 100 lights with a switch next to each of them. Each switch can be flipped between two positions, thereby toggling the on/off states of three lights: its own and the two lights adjacent to it. Initially, all the lights are off. What is the minimum number of switches that turns on all the lights?",
        "original_solution": "You need 100 switches (every light switch needs to be flipped exactly once).",
        "original_answer": "100",
        "original_domain": "int",
        "unpuzzle": "There is a circle of 100 lights with a switch next to each of them. Each switch can be flipped between two positions, thereby toggling the on/off states of two lights: its own and the light to the right of it. Initially, all the lights are off. What is the minimum number of switches that turns on all the lights?",
        "unpuzzle_solution": "Switching every second light will turn every light on. This requires 50 flips.",
        "unpuzzle_answer": "50",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Imagine a circle of 100 ancient obelisks arranged in a circle.  Each obelisk has a hidden mechanism next to it. Activating the mechanism on an obelisk causes it and the obelisk immediately following it in a clockwise direction to magically illuminate or extinguish (if already lit). Initially, all obelisks are dark. What is the fewest number of mechanisms that need to be activated to illuminate all the obelisks?",
        "shifted_unpuzzle_answer": "N",
        "shifted_unpuzzle_domain": "symbols",
        "source": " "
    },
    {
        "puzzle_name": "Circle of Lights 2",
        "original_puzzle": "Consider a circle with 2014 light bulbs and only 2 of them are on and the rest are off. Anyone can choose any of the bulbs and change the state of the neighboring bulbs. Is it possible to switch all the 2014 light bulbs on?",
        "original_solution": "Yes, it is possible to get all the light bulbs ON.\n\nFirstly label all the 2014 light bulbs from B-1 to B-2014(in sequence).\nAs the positions of the light bulbs in the ON state are not mentioned in the problem statement.\nSo, consider that those 2 bulbs are adjacent to each other and are labeled B-1 and B-2.\nTherefore, bulbs labeled from B-3 to B-2014 are initially in the OFF state and all the bulbs in the OFF state are adjacent to each other.",
        "original_answer": "yes",
        "original_domain": "yes, no",
        "unpuzzle": "Consider a circle with 2014 light bulbs and only 2 of them are on and the rest are off. Anyone can choose any of the bulbs and turn off the neighboring bulbs. Is it possible to switch all the 2014 light bulbs on?",
        "unpuzzle_solution": "Light bulbs may only be switched off, so we may never increase the number of bulbs that are on from 2.",
        "unpuzzle_answer": "no",
        "unpuzzle_domain": "yes, no",
        "shifted_unpuzzle": "There is a ball floating in a barrel of oil. First, you tie a heavy metal weight to the ball so that it sinks and measure the oil level. Then, you untie the weight, which remains at the bottom of the barrel, and the ball rises to the surface and floats again. If you measure the level of oil now, will it be higher?",
        "shifted_unpuzzle_answer": "no",
        "shifted_unpuzzle_domain": "yes, no",
        "source": " "
    },
    {
        "puzzle_name": "Two creepers climbing a tree",
        "original_puzzle": "Jasmine and rose creepers are two creepers (climbing plants) that are both climbing up and around a cylindrical tree trunk. Both jasmine and rose begin at the same spot on the ground and twist clockwise and counterclockwise. The rose had done three complete twists and the jasmine had made five before they reached the tree’s first branch. How many times do they cross, excluding the bottom and top?",
        "original_solution": "The first thing to realise is the vertical aspect of the puzzle is something of an illusion. For convenience we will proceed as if they both travel vertically at the same speed and thus complete the journey in the same unspecified time Ttotal, but this is for convenience regardless of the times the path described is the same.\n\nFrom here we may now consider their motion as being constrained to the outer edge of a circle in the horizontal plane. The problem now becomes not dissimilar to a puzzle involving the overlap of the hands of a clock, though of course the hands are moving in opposite directions.\n\nEach of the creepers will have speeds 5w and 3w. Where 'w' is some unspecified angular velocity in degrees per second, although the units are arbitrary. Using speed is distance over time or time = distance / speed, knowing that the total distance travelled 360 degrees times 5 revolutions or 3 revolutions we can easily show Ttotal as a function of w. Ttotal = 360 * 5 / (5w) or Ttotal = 360 * 3 / (3w) hence Ttotal = 360 / w. We will need this later.\n\nThe First Coincidence\nWe now have two motions around a circle starting at one point, travelling in opposite directions, with speeds 3w and 5w. We need to solve this for time.\n\nWe know a total distance of 360 degrees is travelled by two objects with speeds 5w and 3w. Our equations of motion give us:\n\n360=5wt + 3wt = 8wt\nt = 360 / 8w\n\nSo our first overlap is at t = 360 / 8w. In terms of subsequent overlaps the puzzle is in some ways reset. They are co-existent at this time and travelling in opposite directions. if we were to calculate the next time of overlap it would be the same. We now know an overlap occurs every 360 / 8w\nTotal Coincidence\nAn overlap occurs every 360 / 8w for a time of Ttotal = 360 / w hence the number of coincidence is\n\n:Ttotal / time between coincidence\n:(360 / w) / (360 / 8w)\n:8\n\nsince the division is exact we know that the last coincidence is at t = Ttotal, hence there are 7 overlaps not including the top and bottom.",
        "original_answer": "7",
        "original_domain": "int",
        "unpuzzle": "Jasmine and rose creepers are two creepers (climbing plants) that are both climbing up and around a cylindrical tree trunk. Both jasmine and rose begin at the same spot on the ground and twist clockwise and counterclockwise. The rose had done one complete twist and the jasmine had also made one complete twist before they reached the tree’s first branch. How many times do they cross, excluding the bottom and top?",
        "unpuzzle_solution": "A convenient way to see why the creepers cross exactly once is to “unwrap” the cylindrical trunk into a rectangle. Label the vertical direction by z going from 0 (the bottom) to 1 (the top), and label the horizontal direction by the angle θ going around the trunk from 0 to 2π.\n\n• If the rose creeper makes one complete (clockwise) revolution as z goes from 0 to 1, its path on the rectangle can be parameterized by:  \n  θ(rose) = 2πz,    0 ≤ z ≤ 1.\n\n• If the jasmine creeper makes one complete (counterclockwise) revolution, its path on the rectangle can be parameterized by:  \n  θ(jasmine) = −2πz,    0 ≤ z ≤ 1.\n\nFor the two creepers to cross (i.e., occupy the same point on the cylinder), they must have the same z-value and the same angle (modulo 2π). Mathematically, this means:\n\n  2πz = −2πz + 2πk for some integer k,\n\nwhich simplifies to:\n\n  4πz = 2πk  ⇒  z = k/2.\n\nSince z must be between 0 and 1 (excluding the bottom z = 0 and the top z = 1), the only possible integer k that fits is k = 1, giving z = 1/2. This corresponds to exactly one interior crossing. \n\nTherefore, the creepers cross exactly once between the bottom and the top.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Two threads, one crimson and one azure, are being wound around a test tube from the bottom to the top. Both threads start at the same point at the base. The crimson thread spirals upwards in a right-handed helix, completing a full turn before reaching the lip of the tube. Simultaneously, the azure thread spirals upwards in a left-handed helix, also completing a full turn before reaching the lip. Not counting the start and end points, how many times do the two threads intersect?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-two-creepers-climbing-a-tree/"
    },
    {
        "puzzle_name": "6x6 Grid: How many ways?",
        "original_puzzle": "You begin in the top left corner of a 6×6 grid, and your objective is to move to the bottom right corner. There are just two directions you can move: right or down. Both diagonal and backward movements are prohibited. How many different ways are there to get from the start to the finish?",
        "original_solution": "We can think of each path as a sequence of moves.  Since we have to move 5 steps down and 5 steps right (a total of 10 steps), each path is a sequence of 10 moves, where 5 are \"\"down\"\" (D) and 5 are \"\"right\"\" (R).  \n\nThe number of ways to arrange these moves is equivalent to the number of ways to choose which 5 of the 10 moves are \"\"down\"\" (the others must be \"\"right\"\").  This is a combination problem.\n\nThe number of ways to choose 5 \"\"down\"\" moves out of 10 total moves is given by the combination formula:\n\nC(n, k) = n! / (k! * (n-k)!)\n\nIn our case, n = 10 (total moves) and k = 5 (\"\"down\"\" moves):\n\nC(10, 5) = 10! / (5! * 5!) = (10*9*8*7*6) / (5*4*3*2*1) = 252",
        "original_answer": "252",
        "original_domain": "int",
        "unpuzzle": "You begin in the top left corner of a 6×6 grid, and your objective is to move to the top right corner. There are just two directions you can move: right or down. Both diagonal and backward movements are prohibited. How many different ways are there to get from the start to the finish?",
        "unpuzzle_solution": "Since you cannot move up, once you move off the top row, you can never return. Thus, to get to the top right corner, you cannot move off the top row. Every move you make must therefore be to the right, which means that you only have 1 possible path.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A courier is navigating a rectangular street map consisting of 6 avenues running east-west and 6 streets running north-south, forming a 6 × 6 grid of blocks. She starts at the northwest corner of the map and must deliver a package to the northeast corner of the same topmost avenue. From any intersection she may travel only eastward (along the avenue) or southward (down a street). She is never allowed to go west, north, or diagonally. In how many distinct ways can she reach her destination?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-6x6-grid-how-many-ways/"
    },
    {
        "puzzle_name": "Ratio of boys and girls in a country where people want a boy",
        "original_puzzle": "On a country farm, the farmer only wants female chicks. The hens keep having chicks one by one until a female chick is born. What is the expected ratio of male to female chicks on the farm?",
        "original_solution": "1 : 1",
        "original_answer": " ",
        "original_domain": "int",
        "unpuzzle": "On a country farm, the farmer only wants female chicks. The hens keep having chicks one by one until a female chick is born, and all male chicks are immediately given to the neighboring farm. How many males do we expect to be on the farm for every female?",
        "unpuzzle_solution": "We know that all male chicks are given away, meaning that none remain on the farm. Hence, there are 0 males for every female.",
        "unpuzzle_answer": "0",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "In a high-tech pottery workshop, a robotic wheel crafts vases one by one until a flawless vase is produced. Each imperfect vase is instantly smashed and swept away as soon as it is inspected. After many repetitions of this process, how many imperfect vases can we expect to find on the display shelf for every flawless vase?",
        "shifted_unpuzzle_answer": "0",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/baby-ratio-solution.html"
    },
    {
        "puzzle_name": "Car Wheel Puzzle",
        "original_puzzle": "A car has 4 tyres and 1 spare tyre. Each tyre can travel a maximum distance of 20000 km before wearing off. What is the maximum distance, in kilometers, the car can travel before you are forced to buy a new tyre? You are allowed to change tyres (using the spare tyre) an unlimited number of times.",
        "original_solution": "Since the car has 5 tyres and each tyre can travel 20000 km, the total \"\"mileage\"\" available from the tyres is 5 * 20000 = 100000 km.\n\nSince the car needs 4 tyres to operate, we divide the total mileage by the number of tyres needed at a time to get the maximum distance the car can travel: 100000 km / 4 = 25000 km.\n\nMy final answer is: 25000",
        "original_answer": "25000",
        "original_domain": "int",
        "unpuzzle": "A car has 4 tyres and no spare tyres. Each tyre can travel a maximum distance of 20000 km before wearing off. What is the maximum distance, in kilometers, the car can travel before you are forced to buy a new tyre?",
        "unpuzzle_solution": "All tires are used at a constant rate and run out in 20000 km.",
        "unpuzzle_answer": "20000",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A courier drone relies on four propellers to stay airborne, and it carries no spare propellers. Each propeller is rated for at most 20 000 km of flight before it wears out. Assuming all four propellers are used evenly and the drone must land as soon as any one propeller fails, what is the maximum distance, in kilometres, the drone can fly before you must replace a propeller?",
        "shifted_unpuzzle_answer": "20000",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/puzzle-29-car-wheel-puzzle/"
    },
    {
        "puzzle_name": "100 Cows and 10 sons",
        "original_puzzle": "A milkman has 100 cows numbered from 1 to 100. Every cow gives milk according to their numbers i.e the i’th cow gives i liters of milk. The milkman has 10 sons and he wants to divide his cows among his 10 sons so that every son gets an equal amount of milk. Can he do this?",
        "original_solution": "yes; each son gets 505 gallons.",
        "original_answer": "yes",
        "original_domain": "yes, no",
        "unpuzzle": "A milkman has 100 cows numbered from 1 to 100. Every cow gives milk according to their numbers i.e the i’th cow gives i liters of milk. The milkman has 100 sons and he wants to divide his cows among his 100 sons so that every son gets an equal amount of milk. Can he do this?",
        "unpuzzle_solution": "He cannot do this. Since each son only gets one cow, there is no way to equalize the milk production.",
        "unpuzzle_answer": "no",
        "unpuzzle_domain": "yes, no",
        "shifted_unpuzzle": "An industrialist has 100 factories, numbered 1 to 100. Factory i produces i widgets per hour. The industrialist wants to divide his factories between his 100 branches of his company. Can he do this while ensuring that the total production capacity for every branch is the same?",
        "shifted_unpuzzle_answer": "no",
        "shifted_unpuzzle_domain": "yes, no",
        "source": "https://www.geeksforgeeks.org/puzzle-100-cows-and-milk/"
    },
    {
        "puzzle_name": "100 people in a circle with a sword",
        "original_puzzle": "100 people standing in a circle in an order 1 to 100. No. 1 has a sword. He kills the next person (i.e. No. 2) and gives the sword to the next (i.e. No. 3). All people do the same until only 1 survives. Which number survives?",
        "original_solution": "This is the classic Josephus problem.  A simple way to solve it for powers of 2 is to notice that if you have 2<sup>n</sup> people, person 1 survives.  That's because in the first round, all the even-numbered people are eliminated, leaving the odd-numbered people.  Then person 1 eliminates person 3, person 5 eliminates person 7, and so on. This pattern continues until only person 1 remains.\n\nSince 100 is not a power of 2, we find the nearest power of 2 less than 100, which is 64 (2<sup>6</sup>).  When 64 people are eliminated, 36 will remain.  Number 73 will have the sword.  The remaining people are 73, 74, ..., 100 (28 people), and 1, 2, ..., 36 (36 people). This gives a total of 64.\n\nWe can then renumber the survivors from 1 to 64. The person holding the sword is number 73, which translates to number 73 - 36 = 37 in the new numbering from 1 to 64.\n\nIf there were 64, the survivor would be #1.  Since we have 37 which translates to 37 * 2 - 1 = 73 for 100.\n\nFor 100 people, we can represent 100 in binary as 1100100.  Shift the leftmost digit to the right end to get 1001001.  Convert this back to decimal: 64 + 8 + 1 = 73.\n\nMy final answer is: 73",
        "original_answer": "73",
        "original_domain": "int",
        "unpuzzle": "100 people standing in a circle in an order 1 to 100. No. 1 has a sword. He kills the previous person (i.e. No. 100) and gives the sword to the next (i.e. No. 2). All people do the same until only 1 survives. Which number survives?",
        "unpuzzle_solution": "100 is killed by 1, 1 is killed by 2, then 2 is killed by 3, and by induction, n is killed by n+1. The last person is therefore the highest numbered: 99.",
        "unpuzzle_answer": "99",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Imagine 100 adventurers arranged around a circular campfire, numbered 1 through 100 in clockwise order. Adventurer 1 holds a flaming torch.  \\n• The torch-bearer always eliminates the person immediately counter-clockwise (the one with the next lower number, with 1 being just clockwise of 100).  \\n• After doing so, the torch is passed clockwise to the surviving neighbor (the next higher number).  \\n• The process repeats—each new torch-bearer burns the person just counter-clockwise—until only one adventurer remains.  \\n\\nWhich numbered adventurer is the sole survivor?",
        "shifted_unpuzzle_answer": "99",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.geeksforgeeks.org/aptitude/puzzle-100-people-in-a-circle-with-gun-puzzle/"
    },
    {
        "puzzle_name": "Square Persuit",
        "original_puzzle": "Four people start at the corners of a square room, 10 meters on each side. Each person moves at the same speed directly towards the next person counterclockwise as seen from above. As a result, they spiral in until they all eventually collide at the center of the square. How many meters has each person traveled?",
        "original_solution": "10 m. The target for each person is moving at a right angle and not changing the relative distance. Hence, the distance to the next person only changes because of your movement.",
        "original_answer": "10",
        "original_domain": "int",
        "unpuzzle": "Four people start at the corners of a square room, 10 meters on each side. Each person moves at the same speed directly towards the center as seen from above. As a result, they move in an x-pattern until they all eventually collide at the center of the square. How far, to the clostest meter, has each person traveled?",
        "unpuzzle_solution": "Each person moves from the corner of a 10m square to the center which is sqrt(50)m away. Since sqrt(50) is about 7.07, the distance each person traveled, to the closest meter, is 7.",
        "unpuzzle_answer": "7",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Four drones are deployed from equidistant launchpads forming a perfect square with sides of 10 kilometers. Each drone is programmed to fly directly towards the central command beacon. If all drones travel at the same speed, following a converging path, how far, to the closest kilometer, does each drone travel before reaching the beacon?",
        "shifted_unpuzzle_answer": "7",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/square-pursuit.html"
    },
    {
        "puzzle_name": "Water Level",
        "original_puzzle": "There's a toy boat floating in a pool. Place a lead ball in the boat (without sinking it), and measure the level of water in the pool. Now take the ball out of the toy boat and drop it into the pool, and measure the water's level again. Will the water level with the ball dropped in the pool be higher?",
        "original_solution": "Because of bouyancy, the water displaced when the ball is in the boat is equal in weight to the weight of the ball. When the ball is in the water, in only displaces as much water as the volume of the ball. Since lead is denser than water, the amount of water equal in weight to the ball is greater than the amount of water equal in volume to the ball; hence, the water level is higher.",
        "original_answer": "yes",
        "original_domain": "yes, no",
        "unpuzzle": "There's a toy boat floating in a pool. Place a lead ball in the boat, which sinks it, and measure the level of water in the pool. Now take the ball out of the toy boat, drop it into the pool, and make the toy boat float on the water. If you measure the water's level again, will the water level with the ball dropped in the pool be higher?",
        "unpuzzle_solution": "When you measure the water lever with the sunk boat, the water lever will have risen by the volume of the boat and the ball. When you measure the water level the second time, the volume will have risen by the volume of the ball plus the water needed to keep the boat floating. Because the boat is less dense than water (otherwise, it would not float), the volume displayed by the floating boat is less than the volume displayed by the sunk boat.Hence, the water lever will be lower.",
        "unpuzzle_answer": "no",
        "unpuzzle_domain": "yes, no",
        "shifted_unpuzzle": "There is a ball floating in a barrel of oil. First, you tie a heavy metal weight to the ball so that it sinks and measure the oil level. Then, you untie the weight, which remains at the bottom of the barrel, and the ball rises to the surface and floats again. If you measure the level of oil now, will it be higher?",
        "shifted_unpuzzle_answer": "no",
        "shifted_unpuzzle_domain": "yes, no",
        "source": "https://www.mathsisfun.com/puzzles/water-level.html"
    },
    {
        "puzzle_name": "Making Change",
        "original_puzzle": "Sugary Sue runs a small shop which sells sweets which run in price from 1p to 1 Pound with every value in between. One day Hungry Horace came in to spend some of his 1 Pound pocket money. What is the smallest number of coins that Sue needs to set aside to guarantee having exactly the right change for whatever Horace will buy? Type of coins available: 1p, 2p, 5p, 10p, 20p, 50p. Sue needs to be able to make any amount between 1p and 99p.",
        "original_solution": "Sugary Sue only needs to set aside 8 coins to guarantee being able to give any amount of change to Hungry Horace. There are several ways this can be done:\n\n1p, 2p, 2p, 5p, 10p, 20p, 20p, 50p\n1p, 1p, 2p, 5p, 10p, 20p, 20p, 50p\n1p, 2p, 2p, 5p, 10p, 10p, 20p, 50p\n1p, 1p, 2p, 5p, 10p, 10p, 20p, 50p\n\nIn each case it is possible to use just a selection of the 8 coins to make up any amount between 1p and 99p, as required.\n\nHorace gets his change!",
        "original_answer": "8",
        "original_domain": "int",
        "unpuzzle": "Sugary Sue runs a small shop which sells sweets which run in price from 1p to 1 Pound with every value in between. One day Hungry Horace came in to spend some of his 1 Pound pocket money. What is the smallest number of coins that Sue needs to set aside to guarantee having exactly the right change for whatever Horace will buy? Sue only have 1p coins available, but needs to be able to make any amount between 1p and 99p.",
        "unpuzzle_solution": "With only 1p coins available, the worst case change will be having to make 99p. This requires 99 coins.",
        "unpuzzle_answer": "99",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "Barnaby, the baker, sells delicious cookies priced from 1 chip to 100 chips.  A customer, Chuck, enters with exactly 100 chips. Barnaby only has 1-chip tokens in his till for making change. What is the minimum number of 1-chip tokens Barnaby needs to have ready to guarantee he can give the correct change for any possible cookie purchase Chuck might make?",
        "shifted_unpuzzle_answer": "99",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/the-change-will-do-you-good.html"
    },
    {
        "puzzle_name": "Great Picnic",
        "original_puzzle": "When they started off on the great annual picnic every wagon in town was pressed into service, each one carrying the same number of people. Half way to the picnic ground ten wagons broke down, so it was necessary for each of the remaining wagons to carry one more person. When they started for home it was discovered that fifteen more wagons were out of commission, so on the return trip there were three persons more in each wagon than when they started out in the morning. Now who can tell how many wagons the town has?",
        "original_solution": "There must have been 900 picnickers who would be seated 9 to a wagon if there were 100 vehicles, or 10 to a wagon after 10 of the wagons had broken.\n\nWhen they started for home with 75 wagons, it was necessary for 12 persons to ride in each wagon (3 more than the 9 per wagon in the morning).\n\n\nSolving with Algebra\n\nWe can write some formulas. With \"w\" being number of wagons, and \"p\" people per wagon the puzzle tells us:\n\nwp = (w−10)(p+1) = (w−25)(p+3)\n\nNow solve!\n\nExpand the brackets: wp = wp + w − 10p − 10 = wp + 3w − 25p − 25\nSubtract wp from each: 0 = w − 10p − 10 = 3w − 25p − 75\nMultiply middle part by 3: 0 = 3w − 30p − 30 = 3w − 25p − 75\nSubtract middle from last: 0 = 3w − 30p − 30 = 3w − 25p − 75 − (3w − 30p − 30)\nSimplify: 0 = 5p − 45\nLastly: p = 9",
        "original_answer": "100",
        "original_domain": "int",
        "unpuzzle": "When they started off on the great annual picnic every wagon in town was pressed into service, each one carrying the same number of people. Half way to the picnic ground ten wagons broke down, so it was necessary for each of the remaining wagons to carry one more person. When they started for home it was discovered that the ten remaining wagons were out of commission, so on the return trip everyone had to walk. Now who can tell how many wagons the town has?",
        "unpuzzle_solution": "There are 20 wagons: the ten that broke on the way an the 10 that broke at the picnic.",
        "unpuzzle_answer": "20",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A fleet of starships was chartered to transport colonists to a new planet, with each ship carrying an identical number of passengers.  Midway through the voyage, ten starships experienced critical engine failures, requiring the passengers to be redistributed among the remaining vessels. This resulted in each of the operational starships carrying one additional colonist.  Upon reaching the destination, the ten remaining starships were deemed irreparable. How many starships were originally chartered for the voyage?",
        "shifted_unpuzzle_answer": "20",
        "shifted_unpuzzle_domain": "int",
        "source": "https://www.mathsisfun.com/puzzles/great-picnic-puzzle.html"
    },
    {
        "puzzle_name": "Seven Candles",
        "original_puzzle": "On the table are seven lit candles in a circle. When you blow out one candle in the circle, the two adjacent candles are extinguished as well. If you blow on a candle that has already been extinguished, it will relight. And if there is an extinguished candle next to the one you blow on, it also will relight. What is the fewest number of blows you need to extinguish them all?",
        "original_solution": "Seven (blow every candle out once. This is also the minimum solution).",
        "original_answer": "7",
        "original_domain": "int",
        "unpuzzle": "On the table are six lit candles in a circle. When you blow out one candle in the circle, the two adjacent candles are extinguished as well. If you blow on a candle that has already been extinguished, it will relight. And if there is an extinguished candle next to the one you blow on, it also will relight. What is the fewest number of blows you need to extinguish them all?",
        "unpuzzle_solution": "You need two moves: blowing out any two opposite candles will extinguish all of them.",
        "unpuzzle_answer": "2",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "In the heart of the enchanted forest, six ancient runes stand in a clearing, arranged in a ring of power.  A mischievous sprite challenges a passing adventurer. To proceed, the adventurer must deactivate all six runes. Touching a glowing rune will deactivate it, and also deactivate the two runes directly beside it. However, if the touched rune is already deactivated, it will reactivate, and so will any deactivated rune adjacent to it. What is the fewest number of touches needed to deactivate all the runes?",
        "shifted_unpuzzle_answer": "2",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    },
    {
        "puzzle_name": "Le Harve to New York",
        "original_puzzle": "Every day at noon an ocean liner leaves Le Havre to sail for New York, and (simultaneously) an ocean liner sails from New York to Le Havre. The crossing takes exactly seven days and seven nights in either direction. How many other ocean liners will an ocean liner leaving Le Havre today pass at sea before arriving in New York?",
        "original_solution": "The answer is 15 ocean liners. When one sets sail from Le Havre, there are 6 other ocean liners already at sea that set out from New York. In addition to these, 7 more ocean liners will leave New York during the voyage, including the ship that leaves simultaneously from New York as our ship casts off from Le Havre. So a ship leaving Le Havre \"today\" will see 13 other ships in the ocean. In addition to these, it will cross paths with another ship as it casts off from Le Havre, and yet another as soon as it arrives in New York, adding 2 more. ",
        "original_answer": "15",
        "original_domain": "int",
        "unpuzzle": "Every Monday at noon an ocean liner leaves Le Havre to sail for New York, and (simultaneously) an ocean liner sails from New York to Le Havre. The crossing takes exactly seven days and six nights in either direction. How many other ocean liners will an ocean liner leaving Le Havre today pass at sea before arriving in New York?",
        "unpuzzle_solution": "An ocean liner leaving Le Havre on Monday will pass the ocean liner in the opposide direction that left that same Monday and arrive before the next ocean liner sets out; no other ocean liners between Le Harve and New York will be in the sea at the time.",
        "unpuzzle_answer": "1",
        "unpuzzle_domain": "int",
        "shifted_unpuzzle": "A baker in Willow Creek starts baking a batch of sourdough bread every Tuesday at dawn, destined for the market in Oakhaven. Simultaneously, a baker in Oakhaven starts baking a batch of sourdough for the market in Willow Creek. The baking and delivery take precisely 10 hours. How many other sourdough deliveries traveling in the opposite direction will the Willow Creek baker encounter on the road before arriving in Oakhaven?",
        "shifted_unpuzzle_answer": "1",
        "shifted_unpuzzle_domain": "int",
        "source": " "
    }
]
